
_detalhes_global = {
	["npcid_pool"] = {
		[0] = "[*] Shadow Word: Death",
		[170985] = "Carved Hooligan",
		[162873] = "Azmogal",
		[167536] = "Ricocheting Blade",
		[47649] = "Efflorescence <Deluxen-Drak'thul>",
		[168878] = "Wretched Phlegm",
		[159233] = "Sinstone Construct",
		[170028] = "Skeletal Neophyte",
		[163960] = "Ravenous Thirstlurker",
		[133045] = "War Drummer",
		[162875] = "Devmorta",
		[170093] = "Mawsworn Seeker",
		[170157] = "Stygian Runesmith",
		[158979] = "Silent Proctor",
		[170733] = "Gorged Decayfly",
		[167923] = "Diseased Remnant",
		[170031] = "Sylvari Tenderhoof",
		[168690] = "Ossein Drone",
		[6112] = "Windfury Totem <Энха-Ревущийфьорд>",
		[168627] = "Gripping Infection",
		[133049] = "Gunship Warguard",
		[157194] = "Boulderfoot",
		[157833] = "Borr-Geth",
		[172205] = "Bone Thrall",
		[154129] = "Burning Emberguard",
		[172589] = "Lichsworn Sentry",
		[155790] = "Mawsworn Acolyte",
		[159495] = "Mire Dredger",
		[168310] = "Plagueroc",
		[26125] = "Могилогорб <Стергим-Голдринн>",
		[151128] = "Lord of Locks",
		[63508] = "Xuen <Bembz-LaughingSkull>",
		[173549] = "Echo Bullrider",
		[166204] = "Noxious Shambler",
		[165821] = "Manor Leecher",
		[160264] = "Ossein Strongarm",
		[170037] = "Hopeful Aspirant",
		[155793] = "Skeletal Remains",
		[105427] = "Skyfury Totem <Pogerrontare-TarrenMill>",
		[162309] = "Kul'tharok",
		[158796] = "Stonevigil Collector",
		[165503] = "Guarded Defiler",
		[172210] = "Madstitch Fleshcrafter",
		[153878] = "Mawsworn Archer",
		[160074] = "Gorm Slicer",
		[166398] = "Soulforger Rhovus",
		[165504] = "Resilient Monstrosity",
		[167612] = "Stony Veins",
		[166718] = "Manifestation of Envy",
		[173489] = "Stitched Abomination",
		[176108] = "Depraved Usher",
		[165952] = "Primed Defiler",
		[161928] = "Ossein Boneshaper",
		[101085] = "Bear Trap",
		[165697] = "Resilient Monstrosity",
		[158160] = "Seething Voidripper",
		[165953] = "Callused Monstrosity",
		[165506] = "Stitched Defender",
		[158927] = "Depraved Disciple",
		[165634] = "Flayedwing Transporter",
		[165698] = "Bolstered Remnants",
		[2630] = "Earthbind Totem <Энха-Ревущийфьорд>",
		[160716] = "Sinstone Rampager",
		[170042] = "Stoneborn Recruit",
		[59262] = "Demonic Gateway",
		[158928] = "Depraved Witness",
		[158992] = "Stoneborn Steelwing",
		[103673] = "Darkglare <Супербывшая-Ревущийфьорд>",
		[133059] = "General Harris",
		[158162] = "Vile Oozeling",
		[165955] = "Fraying Remnants",
		[165508] = "Maldraxxi Shieldguard",
		[165636] = "Befouler Naux",
		[165189] = "Wolf",
		[169341] = "Soulspliced Veteran",
		[29264] = "Spirit Wolf <Энха-Ревущийфьорд>",
		[176113] = "Carved Tracker",
		[174197] = "Battlefield Ritualist",
		[172217] = "Cankerous Hurler",
		[174325] = "Ascended Lich",
		[165830] = "Callous Peacekeeper",
		[162317] = "Gorechop",
		[168002] = "Empowered Mawsworn Shackler",
		[174773] = "Unknown",
		[165639] = "Osseous Fleshclotter",
		[165831] = "Cruel Collector",
		[166087] = "Privileged Contributor",
		[173433] = "Acolyte Nelesis",
		[167876] = "Anguish",
		[67235] = "Shadowfiend <Aitsch-Draenor>",
		[173114] = "Invasive Decayfly",
		[128140] = "Lightspawn <Tramux-Thrall>",
		[163086] = "Vile Eruption",
		[176117] = "Silent Proctor",
		[175734] = "Stygic Ember <Blazing Stygia>",
		[172221] = "Wretched Assistant",
		[165706] = "Aggregate of Doom",
		[156636] = "Lurking Fearspinner",
		[69791] = "Fire Spirit",
		[164621] = "Oozing Slime",
		[165260] = "Unknown",
		[159192] = "Cloudfeather Greatwing",
		[5913] = "Tremor Totem <Shamtastique-Draenor>",
		[157340] = "Skeletal Remains <Deathspeaker>",
		[170690] = "Decaying Blight",
		[163089] = "Disgusting Refuse",
		[170882] = "Bone Spear",
		[106041] = "Zombie <Стергим-Голдринн>",
		[69792] = "Bembz-LaughingSkull <Bembz-LaughingSkull>",
		[172607] = "Deathshade of Xantuth",
		[160535] = "Ashen Vagrant",
		[159577] = "Malevolent Minion",
		[160727] = "Lingering Malaise",
		[172608] = "Deathshade of Xantuth",
		[172800] = "Enforcer Borgulla",
		[61245] = "Capacitor Totem <Энха-Ревущийфьорд>",
		[173503] = "Studious Acolyte",
		[157726] = "Scorched Scavenger",
		[172609] = "Deathshade of Xantuth",
		[171396] = "Kyrian Goliath",
		[169927] = "Chop",
		[167564] = "Mal'endra",
		[160602] = "Rock Lord",
		[168331] = "Bonescarred Veteran",
		[170950] = "Dredger Clubfighter",
		[167437] = "Margrave Gharmal",
		[155812] = "Mawsworn Ritualist",
		[164563] = "Jagged Swipe",
		[161178] = "Retained Trafficker",
		[170951] = "Dredger Muckfist",
		[167949] = "Plague-Ridden Survivor",
		[156260] = "Depraved Soulflayer",
		[168652] = "Depraved Cryptkeeper",
		[152875] = "Massive Crusher",
		[161179] = "Retained Supplier",
		[158177] = "Void Lasher",
		[158752] = "Predatory Bloodtusk",
		[174210] = "Blighted Sludge-Spewer",
		[161180] = "Maldraxxi Defector",
		[170953] = "Head Pugilist",
		[149555] = "Abomination <Стергим-Голдринн>",
		[159265] = "Tower Creeper",
		[161246] = "Heftor",
		[157733] = "Crazed Ash Ghoul",
		[156264] = "Depraved Epicure",
		[173191] = "Soulstalker V'lara",
		[155945] = "Gherus the Chained",
		[158053] = "Corpselouse Mother",
		[172873] = "Vo'treus the Keyguard",
		[157096] = "Violent Animate",
		[161248] = "Big Shiny",
		[161376] = "Steelspine Veteran",
		[164506] = "Demoralizing Shout",
		[170766] = "Gorm Spewer",
		[416] = "Lazmir <Yruso-DarkmoonFaire>",
		[150965] = "Mawsworn Shackler",
		[58964] = "Xorrik",
		[156203] = "Stygian Incinerator",
		[166487] = "End Gorger",
		[61056] = "Primal Earth Elemental <Pogerrontare-TarrenMill>",
		[60561] = "Earthgrab Totem <Shamtastique-Draenor>",
		[170767] = "Engorged Borer",
		[417] = "Бруними <Супербывшая-Ревущийфьорд>",
		[172556] = "Enchanted Oculus",
		[173642] = "Ruptured Organ <Woeblade>",
		[170768] = "Gorged Decayfly",
		[165339] = "Empowered Baroness Ninadar",
		[172557] = "Lichsworn Guardian",
		[166042] = "Mucksquint",
		[89] = "Infernal <Хитомитанако-СвежевательДуш>",
		[168342] = "Roaming Crackedskull",
		[166426] = "Stitchyard Apprentice",
		[164510] = "Jagged Quarrel",
		[168215] = "Merciless Tormentor",
		[169876] = "Retained Lookout",
		[168918] = "Stone Legion Lookout",
		[166427] = "Stitchyard Surgeon",
		[155824] = "Lumbering Creation",
		[151353] = "Mawrat",
		[168855] = "Unknown",
		[166524] = "Deathwalker <[*] Manifest Death>",
		[165994] = "Grasping Rift <Mordretha, the Endless Empress>",
		[165946] = "Mordretha, the Endless Empress",
		[170234] = "Oppressive Banner <Xav the Unfallen>",
		[175882] = "Mawsworn Outrider",
		[170325] = "Argentwing Larion",
		[162329] = "Xav the Unfallen",
		[167898] = "Mark of Envy <Inquisitor Sigar>",
		[167994] = "Ossified Conscript",
		[59764] = "Healing Tide Totem <Zärby-Ambossar>",
		[14466] = "Horde Battle Standard <Супербывшая-Ревущийфьорд>",
		[164463] = "Paceran the Virulent",
		[165663] = "Genghis",
		[164451] = "Dessia the Decapitator",
		[159659] = "Depraved Soulflayer",
		[164461] = "Sathel the Accursed",
		[170850] = "Raging Bloodhorn",
		[170071] = "Mawsworn Shadestalker",
		[158893] = "Depraved Tutor",
		[167538] = "Dokigg the Brutalizer",
		[165664] = "Befouler Ahnqat",
		[170838] = "Charge",
		[167470] = "Destructor Guttersludge",
		[161257] = "Stacka",
		[173140] = "Soldier of the Frozen Wastes",
		[172627] = "Animated Drudge",
		[155828] = "Runecarved Colossus",
		[173078] = "[DNT] Glacial Spike <Kel'Thuzad>",
		[165665] = "Befouler Ghorout",
		[164707] = "Withering Filth",
		[162727] = "Bubbleblood",
		[172432] = "Skeleton Bulwark",
		[163366] = "Magus of the Dead <Стергим-Голдринн>",
		[172628] = "Recomposed Seeker",
		[173066] = "Kel'Thuzad",
		[163213] = "Maw Infernous",
		[163326] = "Skeletal Defender",
		[163145] = "Necromancer Ritualist",
		[152508] = "Dusky Tremorbeast",
		[161770] = "Lady Ouix'Ara",
		[170521] = "Swift Shadowstalker",
		[175695] = "Stygic Ember",
		[155830] = "Mawsworn Disciple",
		[172142] = "Baroness Ninadar",
		[31216] = "Лайтсх-СвежевательДуш <Лайтсх-СвежевательДуш>",
		[165793] = "Thultain",
		[171245] = "Feral Helhound",
		[162872] = "Xantuth the Blighted",
		[162588] = "Gristlebeak",
		[161388] = "Necromantic Scourer",
		[155831] = "Mawsworn Soulbinder",
		[162744] = "Nekthara the Mangler",
		[172601] = "Necrotic Sorcerer",
		[166754] = "Alexandros's Burden",
		[173669] = "Caravan Guard",
		[100943] = "Earthen Wall Totem <Zärby-Ambossar>",
		[172567] = "Deathshade of Xantuth",
		[173608] = "Elusive Veilwing",
		[172606] = "Unknown",
		[160495] = "Soul Corruption",
		[160048] = "Plaguedoused Remnant",
		[159601] = "Stoneborn Skystalker",
		[173462] = "Madstitch Surgeon",
		[168724] = "Engorged Fearspinner",
		[167458] = "Boneshard Breacher",
		[173143] = "Soul Weaver",
		[167075] = "Battlesewn Flesh",
		[165116] = "Ossein Summon <Ossein Boneshaper>",
		[159027] = "Depraved Stalker",
		[165798] = "Necromancer Ritualist",
		[173463] = "Stitchyard Specialist",
		[173832] = "Sapphiron",
		[163882] = "Toxic Pool",
		[161294] = "Carved Sniffer",
		[158610] = "Voidguard Invader",
		[169875] = "Bind Soul",
		[167533] = "Advent Nevermore",
		[169823] = "Gorm Behemoth",
		[172596] = "Necrotic Acolyte",
		[160076] = "Gorm Borer",
		[165529] = "Collect Sins",
		[5925] = "Grounding Totem <Энха-Ревущийфьорд>",
		[167724] = "Rotbriar Boggart",
		[168697] = "Woeblade",
		[165954] = "Composed Defender",
		[165843] = "Shieldguard Okineda",
		[166393] = "Amalgamation of Filth",
		[167908] = "Stone Legion Warden",
		[158256] = "Corrupted Cloudfeather",
		[166503] = "Abhorrent Butcher",
		[19668] = "Shadowfiend <Вайтмайн-ВечнаяПесня>",
		[166120] = "Voidbound Defender",
		[168007] = "Empowered Mawsworn Soulbinder",
		[165696] = "Guarded Defiler",
		[165635] = "Skeletal Fleshclotter",
		[163961] = "Invasive Mite",
		[98167] = "Void Tendril <Tattergreis-Eredar>",
		[167526] = "Nurgash Muckformed",
		[171016] = "Contagious Droplet",
		[152661] = "Mawsworn Ward",
		[170980] = "Scornful Duelist",
		[168361] = "Fen Hornet",
		[159610] = "Agitated Etherwyrm",
		[154030] = "Oddly Large Mawrat",
		[153165] = "Custodian Thonar",
		[152708] = "Mawsworn Seeker",
		[164589] = "Regenerating Wildseed",
		[99541] = "Risen Skulker <Trippor-Thrall>",
		[165675] = "Baroness Antolyte",
		[158985] = "Living Bulwark",
		[158161] = "Voidguard Invader",
		[165958] = "Skeletal Scrounger",
		[24207] = "Army of the Dead <Стергим-Голдринн>",
		[167528] = "Virulator Ructus",
		[160521] = "Manifestation of Envy",
		[170210] = "Green Spike",
		[170208] = "Blazing Stygia",
		[173405] = "Deathspeaker Yutla",
		[167593] = "Alexandros's Burden",
		[163824] = "Skeletal Guardian <Befouler Naux>",
		[61029] = "Primal Fire Elemental <Pogerrontare-TarrenMill>",
		[157820] = "Magmic Flamebinder",
		[172703] = "Emaciated Etherwyrm",
		[170978] = "Venthyr Brawler",
		[160425] = "Smoldering Bonemauler",
		[173138] = "Mawsworn Outrider",
		[169893] = "Curse of Desolation",
		[159737] = "Boneweave Ambusher",
		[169447] = "Dread Orb",
		[171581] = "Charred Behemoth",
		[172704] = "Insatiable Etherwyrm",
		[105419] = "Dire Basilisk <Grunzi-FestungderStürme>",
		[105451] = "Counterstrike Totem <Pakujin-Spinebreaker>",
		[160632] = "Vulpin Stalker",
		[104493] = "Spitting Cobra <Дочьинженера-Дракономор>",
		[175579] = "Fae Guardian <Transformerr-Khadgar>",
		[160421] = "Devourer Mite",
		[174174] = "Plagueling <Virulator Ructus>",
		[158908] = "Depraved Usher",
		[151127] = "Lord of Torment",
		[120526] = "Домви",
		[165695] = "Stitched Defender",
		[166318] = "Violent Muckmare",
		[95072] = "Greater Earth Elemental <Энха-Ревущийфьорд>",
		[163891] = "Corrosive Gunk",
		[167532] = "Heavin the Breaker",
		[168107] = "Empowered Mawsworn Interceptor",
		[150958] = "Mawsworn Guard",
		[152905] = "Tower Sentinel",
		[159612] = "Leonid",
		[150959] = "Mawsworn Interceptor",
		[166425] = "Empowered Warflesh",
		[163892] = "Corroded Claws",
		[157824] = "Protector of Flame",
		[168108] = "Empowered Lumbering Creation",
		[155908] = "Deathspeaker",
		[159698] = "Obedient Phalynx",
		[160075] = "Gorm Spewer",
		[1863] = "Kalvina",
		[153874] = "Mawsworn Sentry",
		[10467] = "Mana Tide Totem <Shamtastique-Draenor>",
		[167534] = "Unbalancing Blow",
		[157807] = "Mawsworn Soulweaver",
		[158894] = "Depraved Caregiver",
		[165693] = "Skeletal Fleshclotter",
		[167998] = "Shadow Vulnerability",
		[175519] = "Frothing Pustule",
		[168659] = "Strafing Fleshroc",
		[3527] = "Healing Stream Totem <Энха-Ревущийфьорд>",
		[165473] = "Bloodtusk Alpha",
		[172199] = "Maniacal Infuser",
		[165507] = "Bolstered Remnants",
		[167611] = "Hurl Glaive",
		[165414] = "Curse of Obliteration",
		[170513] = "Mawsworn Soulseeker",
	},
	["death_recap"] = {
		["enabled"] = true,
		["show_segments"] = false,
		["show_life_percent"] = false,
		["relevance_time"] = 7,
	},
	["spell_pool"] = {
		4, -- [1]
		3, -- [2]
		"Environment (Falling)", -- [3]
		[204262] = 7,
		[53385] = 2,
		[321442] = 7,
		[324514] = "[*] Manifest Death",
		[7268] = 8,
		[347037] = 4,
		[323491] = 2,
		[317349] = 1,
		[198121] = 8,
		[85256] = 2,
		[127230] = 5,
		[332708] = "Heavin the Breaker",
		[199658] = 1,
		[60424] = 11,
		[264119] = 9,
		[204266] = 7,
		[323497] = 2,
		[335783] = "Mawsworn Ritualist",
		[351140] = 8,
		[323500] = 7,
		[347047] = 8,
		[94472] = 5,
		[90633] = 8,
		[338858] = "Nurgash Muckformed",
		[51723] = 4,
		[108293] = 11,
		[317361] = 2,
		[24394] = "Centuria <Fridion>",
		[107270] = 10,
		[57994] = 7,
		[527] = 5,
		[2139] = 8,
		[8680] = 4,
		[323509] = 2,
		[317367] = "Kul'tharok",
		[323510] = 2,
		[8936] = 11,
		[262115] = 1,
		[338868] = "Nurgash Muckformed",
		[324536] = 9,
		[339894] = 12,
		[589] = 5,
		[338871] = "Soulstalker V'lara",
		[323515] = "Gorechop",
		[338872] = "Nurgash Muckformed",
		[327611] = 6,
		[324540] = 9,
		[605] = 5,
		[267211] = 9,
		[190456] = 1,
		[337851] = 2,
		[176124] = "Invasive Decayfly",
		[267213] = 9,
		[337852] = 2,
		[633] = 2,
		[345019] = 1,
		[200183] = 5,
		[345020] = 1,
		[341949] = "[*] Withering Blight",
		[178173] = 10,
		[5221] = 11,
		[336832] = 8,
		[2643] = 3,
		[323524] = 6,
		[267218] = 9,
		[318406] = "Gorechop",
		[304075] = "Deathspeaker",
		[330693] = "Blighted Sludge-Spewer",
		[330694] = "Blighted Sludge-Spewer",
		[49039] = 6,
		[53390] = 7,
		[322507] = 10,
		[344006] = 10,
		[193534] = 3,
		[202748] = 3,
		[218617] = 1,
		[47632] = 6,
		[236021] = 11,
		[195072] = 12,
		[183811] = 2,
		[196608] = 10,
		[222202] = 10,
		[198144] = 8,
		[781] = 3,
		[124682] = 10,
		[193538] = 4,
		[265187] = 9,
		[263140] = 3,
		[341969] = "Blighted Sludge-Spewer",
		[47633] = 6,
		[336851] = 3,
		[196099] = 9,
		[30283] = 9,
		[342995] = 5,
		[304093] = "Deathspeaker",
		[196100] = 9,
		[102417] = 11,
		[345044] = 2,
		[350163] = "Spiteful Shade",
		[342997] = 9,
		[290786] = 2,
		[845] = 1,
		[200196] = 5,
		[323547] = 4,
		[345046] = 2,
		[288740] = 5,
		[339928] = 3,
		[339929] = 3,
		[320478] = "Mawsworn Interceptor",
		[341977] = "Diseased Horror",
		[330716] = "Portal Guardian",
		[190984] = 11,
		[264173] = 9,
		[48018] = 9,
		[883] = 3,
		[290792] = 6,
		[195592] = 7,
		[290793] = 5,
		[330720] = "Portal Guardian",
		[321507] = 8,
		[200200] = 5,
		[229377] = 5,
		[264178] = 9,
		[228354] = 8,
		[86040] = 9,
		[270323] = 3,
		[330725] = "Portal Guardian",
		[185358] = 3,
		[347106] = "Dathlane the Herald",
		[323560] = 4,
		[122128] = 5,
		[26573] = 2,
		[343013] = 12,
		[339943] = 11,
		[336872] = 2,
		[288756] = 10,
		[270329] = 3,
		[228358] = 8,
		[307185] = 2,
		[336874] = 10,
		[31884] = 2,
		[198158] = 8,
		[339946] = 11,
		[263165] = 5,
		[321519] = 8,
		[48020] = 9,
		[307187] = 6,
		[153626] = 8,
		[228360] = 5,
		[257537] = 8,
		[37015] = 7,
		[270335] = 3,
		[295929] = "Oddly Large Mawrat",
		[224266] = 2,
		[257538] = 8,
		[229385] = 10,
		[321524] = 11,
		[307192] = 6,
		[176151] = 1,
		[270339] = 3,
		[115989] = 6,
		[321527] = 7,
		[1122] = 9,
		[202770] = 11,
		[336885] = 3,
		[203794] = 12,
		[257541] = 8,
		[45334] = 11,
		[53652] = 2,
		[203795] = 12,
		[257542] = 8,
		[290819] = 3,
		[291843] = 10,
		[117526] = 3,
		[118038] = 1,
		[203796] = 12,
		[31821] = 2,
		[203285] = 8,
		[330749] = 2,
		[203286] = 8,
		[254474] = 2,
		[262161] = 1,
		[188443] = 7,
		[1330] = 4,
		[346111] = 5,
		[333827] = "Advent Nevermore",
		[332804] = 2,
		[332805] = 2,
		[201754] = 1,
		[348162] = 11,
		[325640] = 9,
		[115994] = 6,
		[329737] = 1,
		[5782] = 9,
		[153640] = 8,
		[1490] = 12,
		[79140] = 4,
		[257040] = 3,
		[319504] = 4,
		[48792] = 6,
		[93985] = 11,
		[333839] = "Rek the Hardened",
		[334863] = 2,
		[198688] = 4,
		[195617] = 6,
		[6262] = 6,
		[152108] = 9,
		[333841] = "Rek the Hardened",
		[194594] = 3,
		[6358] = "Домви <Супербывшая-Ревущийфьорд>",
		[203808] = 5,
		[59542] = 2,
		[157228] = 11,
		[257044] = 3,
		[48025] = 4,
		[324631] = 2,
		[246807] = 2,
		[323608] = "Mordretha, the Endless Empress",
		[257045] = 3,
		[222238] = 8,
		[269352] = 7,
		[1706] = 5,
		[265258] = 5,
		[1714] = 9,
		[280615] = 7,
		[225311] = 2,
		[106785] = 11,
		[119582] = 10,
		[184362] = 1,
		[1766] = 4,
		[337948] = 5,
		[335901] = 7,
		[193065] = 5,
		[330784] = "Battlefield Ritualist",
		[335903] = 7,
		[1822] = 11,
		[184364] = 1,
		[16979] = 11,
		[85288] = 1,
		[1850] = 11,
		[148022] = 8,
		[342049] = 3,
		[332836] = "Putrid Butcher",
		[195627] = 4,
		[345122] = 5,
		[337956] = 5,
		[199723] = 6,
		[212520] = 1,
		[184367] = 1,
		[317483] = 1,
		[189998] = 11,
		[83242] = 3,
		[203819] = 12,
		[265273] = 9,
		[7814] = "Домви <Супербывшая-Ревущийфьорд>",
		[317485] = 1,
		[1966] = 4,
		[335913] = 10,
		[132158] = 11,
		[202797] = 3,
		[83243] = 3,
		[317488] = 1,
		[317489] = 1,
		[282682] = 2,
		[32592] = 5,
		[183347] = "Soulstalker V'lara",
		[315443] = 6,
		[2060] = 5,
		[317491] = 1,
		[319539] = "Kul'tharok",
		[334896] = 6,
		[229417] = 12,
		[204336] = 7,
		[209967] = "Dire Basilisk <Fridion>",
		[328757] = 3,
		[292926] = "Lord of Torment",
		[323639] = 12,
		[295998] = 2,
		[317497] = 1,
		[337973] = 6,
		[243241] = 5,
		[115750] = 2,
		[49821] = 5,
		[33697] = 7,
		[344118] = 11,
		[62618] = 5,
		[330810] = "Shackled Soul",
		[344120] = 3,
		[59547] = 7,
		[51485] = 7,
		[111400] = 9,
		[344121] = 3,
		[236077] = 1,
		[2484] = 7,
		[10060] = 5,
		[24275] = 2,
		[342076] = 3,
		[5143] = 8,
		[2580] = 6,
		[191034] = 11,
		[10444] = 7,
		[192058] = 7,
		[50334] = 11,
		[132169] = 1,
		[105771] = 1,
		[297035] = 10,
		[197690] = 1,
		[323654] = 4,
		[43680] = 7,
		[292942] = "Lord of Locks",
		[108843] = 8,
		[191037] = 11,
		[337989] = 6,
		[201787] = 10,
		[120361] = 3,
		[88625] = 5,
		[2908] = 11,
		[331850] = 4,
		[296019] = "Lord of Locks",
		[288853] = 6,
		[2948] = 8,
		[43681] = 7,
		[116267] = 8,
		[52127] = 7,
		[296023] = "Lord of Locks",
		[204350] = 7,
		[295000] = "Lord of Locks",
		[295001] = "Lord of Locks",
		[101168] = 2,
		[165961] = 11,
		[52128] = 7,
		[323673] = 5,
		[186439] = 7,
		[116014] = 8,
		[203843] = 5,
		[6807] = 11,
		[342103] = "[*] Rancid Bile",
		[331866] = 1,
		[211522] = 5,
		[187464] = 5,
		[208963] = 7,
		[324701] = 8,
		[344153] = 1,
		[325727] = 11,
		[344155] = 1,
		[291944] = 2,
		[323681] = "Mordretha, the Endless Empress",
		[41252] = 11,
		[255546] = 4,
		[107570] = 1,
		[54049] = "Зоррик",
		[33702] = 8,
		[344158] = 1,
		[325733] = 11,
		[315496] = 4,
		[204361] = 7,
		[205385] = 5,
		[185422] = 4,
		[212552] = 6,
		[205386] = 5,
		[27285] = 9,
		[46628] = 7,
		[343144] = 5,
		[324717] = 2,
		[198222] = 4,
		[108853] = 8,
		[246851] = 3,
		[204366] = 7,
		[340077] = 2,
		[316531] = 1,
		[246852] = 3,
		[315508] = 4,
		[342126] = "Dokigg the Brutalizer",
		[188499] = 12,
		[221771] = 10,
		[223819] = 2,
		[325748] = 11,
		[334962] = 2,
		[323701] = 5,
		[330868] = "Maniacal Soulbinder",
		[188501] = 12,
		[338036] = 7,
		[230987] = 11,
		[344179] = 7,
		[346227] = 2,
		[339061] = 3,
		[304254] = "Gherus the Chained",
		[323706] = 5,
		[204883] = 5,
		[342135] = "Heavin the Breaker",
		[294020] = 7,
		[323710] = 6,
		[345209] = 11,
		[97340] = 8,
		[345211] = 11,
		[280715] = 1,
		[127797] = 11,
		[340094] = 4,
		[244813] = 8,
		[192090] = 11,
		[324739] = 2,
		[270481] = "Demonic Tyrant <Irmavep-Terokkar>",
		[345215] = 11,
		[328837] = 3,
		[333957] = 7,
		[345219] = 5,
		[319626] = "Kul'tharok",
		[5672] = "Healing Stream Totem <Банндэр-Ревущийфьорд>",
		[343173] = 4,
		[260173] = 1,
		[211545] = 11,
		[167012] = "Gherus the Chained",
		[260174] = 5,
		[324748] = 4,
		[55078] = 6,
		[197214] = 7,
		[47528] = 6,
		[260175] = 12,
		[332940] = 2,
		[333964] = 7,
		[246867] = 2,
		[44457] = 8,
		[113724] = 8,
		[322705] = 2,
		[311444] = 6,
		[345228] = 4,
		[119611] = 10,
		[279709] = 11,
		[212061] = "Mawsworn Shadestalker",
		[345230] = 3,
		[317589] = 8,
		[12654] = 8,
		[319637] = "[*] Reclaimed Soul",
		[345231] = 7,
		[280735] = 1,
		[192611] = 12,
		[127802] = 8,
		[311449] = 8,
		[325782] = "Gorm Behemoth",
		[257620] = 3,
		[217694] = 8,
		[212064] = "Mawsworn Shadestalker",
		[171626] = 6,
		[311452] = 4,
		[152175] = 10,
		[257622] = 3,
		[34477] = 3,
		[34861] = 5,
		[213602] = 5,
		[311457] = 2,
		[331934] = 7,
		[320674] = 7,
		[194153] = 11,
		[192106] = 7,
		[331937] = 4,
		[317605] = "Nekthara the Mangler",
		[77130] = 7,
		[331939] = 4,
		[234081] = 11,
		[43308] = 3,
		[323750] = "[*] Vile Gas",
		[320679] = 1,
		[199786] = 8,
		[311466] = 9,
		[117313] = 1,
		[311467] = 8,
		[345251] = 11,
		[118337] = 7,
		[192109] = 7,
		[311468] = 9,
		[342181] = 6,
		[311469] = 8,
		[195181] = 6,
		[330921] = 11,
		[311470] = 8,
		[121153] = 4,
		[346278] = 12,
		[311471] = 9,
		[195182] = 6,
		[171636] = 3,
		[19483] = "Infernal <Хитомитанако-СвежевательДуш>",
		[47788] = 5,
		[236645] = 8,
		[32216] = 1,
		[311474] = 8,
		[341163] = "Kyrian Goliath <Fridion>",
		[321712] = 8,
		[44461] = 8,
		[311475] = 8,
		[330927] = 11,
		[311476] = 8,
		[341165] = "Kyrian Goliath <Fridion>",
		[311477] = 11,
		[339119] = 2,
		[311478] = 8,
		[326835] = "Ossified Conscript",
		[117828] = 9,
		[311480] = 8,
		[107079] = 8,
		[311481] = 8,
		[322743] = "Lumbering Creation",
		[311483] = 2,
		[260708] = 1,
		[135299] = 3,
		[311485] = 2,
		[329913] = "Mawsworn Shadestalker",
		[217200] = 3,
		[311487] = 3,
		[311488] = 3,
		[329916] = "Mawsworn Shadestalker",
		[247402] = 3,
		[315584] = 4,
		[241260] = 6,
		[155777] = 11,
		[201846] = 7,
		[311491] = 2,
		[232559] = 11,
		[330943] = 11,
		[311492] = 6,
		[20572] = 3,
		[311493] = 12,
		[49966] = "Wespe <Izek-Shattrath>",
		[330945] = 3,
		[340159] = 5,
		[2645] = 7,
		[311495] = 12,
		[59052] = 6,
		[311496] = 6,
		[337090] = 8,
		[78674] = 11,
		[311497] = 12,
		[51886] = 7,
		[195707] = 11,
		[311498] = 11,
		[297166] = "Massive Crusher",
		[262359] = 8,
		[118089] = 3,
		[114250] = 2,
		[15407] = 5,
		[339142] = 11,
		[22812] = 11,
		[109132] = 10,
		[55342] = 8,
		[328908] = 6,
		[47536] = 5,
		[64044] = 5,
		[308434] = 6,
		[213115] = 1,
		[106830] = 11,
		[33076] = 5,
		[108366] = 9,
		[264420] = 4,
		[323798] = 6,
		[320729] = "Xav the Unfallen",
		[188550] = 11,
		[323802] = 12,
		[228477] = 12,
		[53] = 4,
		[13584] = "Mawsworn Ward",
		[341207] = 5,
		[337113] = 9,
		[342232] = 8,
		[81751] = 5,
		[196742] = 10,
		[225919] = 12,
		[51505] = 7,
		[123725] = 10,
		[47666] = 5,
		[330973] = "Rancid Gasbag",
		[333021] = 12,
		[183435] = 2,
		[328928] = 7,
		[338142] = 11,
		[33206] = 5,
		[328930] = 7,
		[285933] = 9,
		[198793] = 12,
		[340193] = 2,
		[205448] = 5,
		[327909] = 2,
		[328933] = 7,
		[275699] = 6,
		[321768] = 3,
		[113746] = 10,
		[345316] = 4,
		[342245] = 8,
		[212105] = 12,
		[341223] = 3,
		[305392] = 6,
		[345319] = 11,
		[212106] = 12,
		[326892] = "Dessia the Decapitator",
		[47540] = 5,
		[320751] = 7,
		[305395] = 2,
		[340203] = 2,
		[320752] = 7,
		[72286] = 1,
		[203406] = 11,
		[229512] = 2,
		[213644] = 2,
		[123986] = 10,
		[203407] = 11,
		[191634] = 7,
		[66] = 8,
		[117588] = "Primal Fire Elemental <Pumpactionz-TarrenMill>",
		[337137] = 8,
		[51124] = 6,
		[106839] = 11,
		[269571] = 2,
		[128594] = 3,
		[339187] = 7,
		[197268] = 5,
		[119381] = 10,
		[340214] = 2,
		[320763] = 7,
		[269576] = 3,
		[335097] = 1,
		[345335] = 12,
		[73313] = 6,
		[335098] = 1,
		[51637] = 4,
		[325886] = 1,
		[335100] = 1,
		[321792] = 9,
		[336126] = 8,
		[261769] = 10,
		[324867] = 7,
		[17057] = 11,
		[343295] = 6,
		[308488] = 7,
		[124503] = 10,
		[327942] = 7,
		[148135] = 10,
		[346370] = 1,
		[198300] = 7,
		[314637] = 2,
		[197277] = 2,
		[198813] = 12,
		[294165] = "Mawsworn Guard",
		[336139] = 2,
		[308498] = 3,
		[314641] = 2,
		[1543] = 3,
		[347404] = "Mawsworn Disciple",
		[115804] = 10,
		[124506] = 10,
		[341263] = 5,
		[314646] = 2,
		[260242] = 3,
		[320789] = "Xav the Unfallen",
		[55095] = 6,
		[277792] = 8,
		[196770] = 6,
		[260243] = 3,
		[79206] = 7,
		[154797] = 11,
		[196771] = 6,
		[205473] = 8,
		[202914] = 3,
		[114014] = 4,
		[93795] = 8,
		[212640] = "Lusion-ChamberofAspects",
		[45242] = 5,
		[272678] = 3,
		[123996] = "Xuen <Montane-Drak'thul>",
		[272679] = 3,
		[326939] = 7,
		[1715] = 1,
		[248473] = 6,
		[199845] = "Psyfiend <Børntokïll-Archimonde>",
		[337178] = "Unyielding Contender",
		[272682] = 3,
		[260247] = 3,
		[308514] = 11,
		[32223] = 2,
		[260249] = 3,
		[253595] = 6,
		[333089] = 6,
		[199337] = "Bear Trap",
		[116] = 8,
		[51514] = 7,
		[247454] = 12,
		[274738] = 7,
		[341282] = 5,
		[146615] = 4,
		[253597] = 6,
		[64695] = "Earthgrab Totem <Piotruss-EmeraldDream>",
		[247455] = 12,
		[130654] = 10,
		[120] = 8,
		[342309] = 1,
		[231588] = 2,
		[1943] = 4,
		[195757] = 6,
		[96103] = 1,
		[73325] = 5,
		[194223] = 11,
		[8042] = 7,
		[341291] = 5,
		[309555] = 2,
		[8122] = 5,
		[323889] = 4,
		[275773] = 2,
		[53563] = 2,
		[130] = 8,
		[2094] = 4,
		[212653] = 8,
		[133] = 8,
		[136] = 3,
		[234153] = 9,
		[139] = 5,
		[203953] = 11,
		[275779] = 2,
		[330038] = 3,
		[65081] = 5,
		[81262] = "Efflorescence <Quintette-KirinTor>",
		[336182] = 7,
		[61882] = 7,
		[119909] = 9,
		[19236] = 5,
		[189112] = 12,
		[198838] = 7,
		[4987] = 2,
		[80240] = 9,
		[343355] = 5,
		[198839] = "Earthen Wall Totem <Zärby-Ambossar>",
		[93805] = 4,
		[333120] = 12,
		[291147] = 5,
		[50622] = 1,
		[17253] = "Centuria <Fridion>",
		[93806] = 6,
		[331075] = 2,
		[152261] = 2,
		[297292] = "Custodian Thonar",
		[124007] = "Xuen <Fisco-Ravencrest>",
		[305483] = 7,
		[183998] = 2,
		[116841] = 10,
		[152262] = 2,
		[259756] = 9,
		[305485] = 7,
		[108396] = 9,
		[258222] = "Gorged Decayfly",
		[347462] = 12,
		[267611] = 2,
		[290134] = 5,
		[124009] = "Xuen <Montane-Drak'thul>",
		[32290] = 3,
		[337228] = 2,
		[259760] = 5,
		[223929] = 6,
		[216251] = 7,
		[49088] = 6,
		[297304] = "Custodian Thonar",
		[3110] = "Dagbis <Makaveliuk-Moonglade>",
		[228537] = 12,
		[16870] = 11,
		[116844] = 10,
		[221883] = 2,
		[305496] = 11,
		[81269] = 11,
		[305497] = 11,
		[191685] = 6,
		[110959] = 8,
		[6795] = 11,
		[200389] = 11,
		[311648] = 6,
		[110960] = 8,
		[317791] = "Magus of the Dead <Стергим-Голдринн>",
		[19750] = 2,
		[317792] = "Magus of the Dead <Стергим-Голдринн>",
		[116847] = 10,
		[325983] = 2,
		[325984] = 2,
		[145109] = 11,
		[203975] = 11,
		[145110] = 11,
		[345439] = 4,
		[348511] = 2,
		[86392] = 4,
		[197834] = 4,
		[339298] = 9,
		[348512] = 2,
		[56641] = 3,
		[48707] = 6,
		[343396] = 8,
		[173266] = 1,
		[343399] = 2,
		[260286] = 3,
		[199373] = "Army of the Dead <Стергим-Голдринн>",
		[93816] = 4,
		[343400] = 2,
		[203981] = 12,
		[148187] = 10,
		[113780] = 4,
		[32612] = 8,
		[213708] = 11,
		[213709] = 11,
		[68992] = 11,
		[214222] = 2,
		[327029] = "Shambling Arbalest",
		[167130] = "Invasive Decayfly",
		[120692] = 5,
		[233674] = 11,
		[210128] = 6,
		[44614] = 8,
		[304510] = 2,
		[205523] = 10,
		[339321] = 2,
		[13877] = 4,
		[345466] = 6,
		[93821] = 2,
		[5116] = 3,
		[197336] = 5,
		[119415] = 8,
		[341374] = 5,
		[58180] = 11,
		[5308] = 1,
		[348542] = 2,
		[267666] = 3,
		[212182] = 4,
		[348543] = 2,
		[339] = 11,
		[5484] = 9,
		[104316] = 9,
		[348] = 9,
		[44744] = 7,
		[22568] = 11,
		[272790] = 3,
		[274838] = 2,
		[124280] = 10,
		[5740] = 9,
		[116858] = 9,
		[346502] = 12,
		[346503] = 12,
		[51271] = 6,
		[370] = 7,
		[104318] = "Wild Imp <Irmavep-Terokkar>",
		[379] = 7,
		[192225] = 2,
		[210141] = 6,
		[91778] = "Могилогорб",
		[328082] = 4,
		[327059] = 9,
		[338321] = 10,
		[330132] = 5,
		[337299] = 8,
		[408] = 4,
		[205025] = 8,
		[315802] = "Mawsworn Interceptor",
		[212704] = 3,
		[259285] = 3,
		[54216] = "FIFI",
		[323996] = 12,
		[13750] = 4,
		[19434] = 3,
		[6940] = 2,
		[281000] = 1,
		[340378] = 2,
		[60103] = 7,
		[340379] = 2,
		[271788] = 3,
		[342428] = 4,
		[196840] = 7,
		[66188] = 6,
		[167152] = 8,
		[324003] = 5,
		[272816] = 11,
		[322980] = "Wild Gormling",
		[324004] = 2,
		[333218] = 3,
		[272817] = 11,
		[314791] = 8,
		[465] = 2,
		[269747] = 3,
		[52042] = "Healing Stream Totem <Банндэр-Ревущийфьорд>",
		[314793] = 8,
		[338340] = 7,
		[15286] = 5,
		[22570] = 11,
		[210153] = 12,
		[228581] = 6,
		[147193] = 5,
		[217832] = 12,
		[338344] = 7,
		[114051] = 7,
		[46924] = 1,
		[63560] = 6,
		[498] = 2,
		[166646] = 10,
		[326062] = 1,
		[306611] = 2,
		[311730] = 6,
		[8092] = 5,
		[197871] = 5,
		[114052] = 7,
		[98440] = 4,
		[333231] = "Sathel the Accursed",
		[528] = 5,
		[339376] = 2,
		["DEBUFF"] = 7,
		[312759] = 3,
		[236776] = 3,
		[546] = 7,
		[236777] = 3,
		[323000] = "Wild Gormling",
		[115078] = 10,
		[586] = 5,
		[204019] = 2,
		[2383] = 6,
		[333242] = "Raging Bloodhorn",
		[326076] = 1,
		[339385] = 1,
		[51533] = 7,
		[243435] = 10,
		[2479] = 8,
		[204021] = 12,
		[208628] = 12,
		[345530] = 7,
		[327104] = 10,
		[642] = 2,
		[66196] = 6,
		[324034] = 2,
		[49998] = 6,
		[269776] = 1,
		[5277] = 4,
		[54861] = 11,
		[81297] = 2,
		[25771] = 2,
		[236273] = 1,
		[686] = 9,
		[52174] = 1,
		[64843] = 5,
		[317898] = 2,
		[2823] = 4,
		[66198] = 6,
		[228597] = 8,
		[213241] = 12,
		[27243] = 9,
		[339400] = 3,
		[228598] = 8,
		[323021] = 2,
		[118922] = 3,
		[31850] = 2,
		[47568] = 6,
		[2983] = 4,
		[345545] = 3,
		[213243] = 12,
		[345546] = 3,
		[64844] = 5,
		[289241] = 11,
		[768] = 11,
		[102543] = 11,
		[345548] = 1,
		[774] = 11,
		[12472] = 8,
		[294362] = "Deathspeaker",
		[319957] = 1,
		[347600] = 3,
		[8921] = 11,
		[67481] = 3,
		[131347] = 12,
		[82326] = 2,
		[111759] = 5,
		[339415] = "Xav the Unfallen",
		[194310] = 6,
		[194311] = 6,
		[332252] = 12,
		[317920] = 2,
		[212739] = 6,
		[224001] = 11,
		[61391] = 11,
		[319970] = 8,
		[185099] = 10,
		[33110] = 5,
		[264689] = 8,
		[89751] = "Bleekvegen <Irmavep-Terokkar>",
		[345569] = 4,
		[212743] = 4,
		[317929] = 2,
		[199435] = 2,
		[196364] = 9,
		[344548] = 7,
		[45524] = 6,
		[216328] = 2,
		[50259] = 11,
		[980] = 9,
		[23214] = 2,
		[343527] = 2,
		[89753] = "Bleekvegen <Irmavep-Terokkar>",
		[262652] = 7,
		[178963] = 12,
		[324079] = "Mordretha, the Endless Empress",
		[213771] = 11,
		[20271] = 2,
		[333294] = "Nefarious Darkspeaker",
		[1022] = 2,
		[1044] = 2,
		[334320] = 9,
		[196881] = 7,
		[1064] = 7,
		[324085] = "Dessia the Decapitator",
		[333299] = "Nefarious Darkspeaker",
		[257284] = 3,
		[336372] = 10,
		[333301] = "[*] Curse of Desolation",
		[279043] = 4,
		[271877] = 4,
		[196884] = 7,
		[22703] = 9,
		[157982] = 11,
		[327162] = 7,
		[344566] = 9,
		[327163] = 7,
		[319997] = "Shambling Arbalest",
		[271881] = 4,
		[77472] = 7,
		[327164] = 7,
		[110744] = "Pugzy-Silvermoon",
		[325118] = 5,
		[52437] = 1,
		[247563] = 5,
		[345595] = 10,
		[344572] = 1,
		[199448] = 2,
		[5246] = 1,
		[324099] = 2,
		[5374] = 4,
		[343553] = "Unknown",
		[207640] = 11,
		[39897] = 5,
		[344578] = 9,
		[320009] = 11,
		[216343] = 6,
		[115098] = 10,
		[325130] = 8,
		[339463] = 5,
		[271896] = 4,
		[149801] = 12,
		[1464] = 1,
		[331275] = "Advent Nevermore",
		[19505] = "Bragmek",
		[23920] = 1,
		[28271] = 8,
		[321041] = "Disgusting Refuse",
		[264735] = 3,
		[209693] = 12,
		[115356] = 7,
		[318995] = "Gherus the Chained",
		[260881] = 7,
		[334352] = 8,
		[108446] = 9,
		[328210] = 3,
		[21169] = 7,
		[77478] = 7,
		[188196] = 7,
		[283167] = 12,
		[193315] = 4,
		[115357] = 7,
		[108447] = 9,
		[132403] = 2,
		[93347] = 3,
		[1680] = 1,
		[316958] = 2,
		[205604] = 12,
		[341530] = 4,
		[334364] = 3,
		[28272] = 8,
		[1784] = 4,
		[334366] = 5,
		[53209] = 3,
		[233759] = 10,
		[341533] = 4,
		[115360] = 7,
		[145205] = 11,
		[320035] = 8,
		[108194] = 6,
		[323107] = "Oozing Leftovers",
		[132409] = 9,
		[236320] = 1,
		[1856] = 4,
		[323110] = "Oozing Leftovers",
		[236321] = 3,
		[287280] = 2,
		[322088] = "Kul'tharok",
		[328231] = 3,
		[15290] = 5,
		[85673] = 2,
		[131900] = 3,
		[107428] = 10,
		[345638] = 8,
		[202028] = 11,
		[7870] = "Домви",
		[101542] = 11,
		[114083] = 7,
		[346665] = 12,
		[343594] = 8,
		[324143] = 1,
		[331310] = "Green Spike",
		[187698] = 3,
		[320050] = "Xav the Unfallen",
		[53595] = 2,
		[332336] = 3,
		[341550] = 4,
		[2120] = 8,
		[316981] = "Xav the Unfallen",
		[322101] = 10,
		[324149] = 3,
		[331316] = "Dokigg the Brutalizer",
		[325174] = 7,
		[315961] = 1,
		[101033] = 7,
		[30449] = 8,
		[101545] = 10,
		[339509] = 2,
		[303678] = "Skeletal Remains <Deathspeaker>",
		[2336] = 2,
		[121253] = 10,
		[210738] = 6,
		[324156] = 3,
		[322109] = 10,
		[204596] = 12,
		[127140] = 8,
		[320063] = "Dessia the Decapitator",
		[268877] = 3,
		[122278] = 10,
		[77489] = 5,
		[204598] = 12,
		[337470] = 12,
		[2584] = 2,
		[57820] = 6,
		[340542] = 5,
		[5215] = 11,
		[187707] = 3,
		[100780] = 10,
		[320069] = "Dessia the Decapitator",
		[296523] = "Mawsworn Seeker",
		[160067] = "Паук",
		[334403] = 2,
		[235313] = 8,
		[340546] = 11,
		[5487] = 11,
		[235314] = 8,
		[199483] = 3,
		[338501] = 6,
		[212792] = 8,
		[345668] = 2,
		[33763] = 11,
		[117418] = 10,
		[122281] = 10,
		[134477] = "Bleekvegen <Irmavep-Terokkar>",
		[274009] = 6,
		[27827] = 5,
		[190784] = 2,
		[345673] = 11,
		[212283] = 4,
		[225080] = 7,
		[317009] = 12,
		[281178] = 2,
		[306772] = "[*] Massive Scythe",
		[340556] = 11,
		[118699] = 9,
		[49376] = 11,
		[336463] = 8,
		[325202] = 10,
		[100784] = 10,
		[260402] = 3,
		[114093] = 7,
		[330323] = 5,
		[47585] = 5,
		[83381] = 1,
		[340563] = 9,
		[125355] = 10,
		[30451] = "Applejooce-TarrenMill",
		[324184] = 2,
		[212800] = 12,
		[53600] = 2,
		[344662] = 3,
		[3408] = 4,
		[344664] = 3,
		[19574] = 3,
		[66235] = 2,
		[345689] = 10,
		[335452] = 1,
		[330334] = 1,
		[132951] = 12,
		[281195] = 3,
		[3600] = "Earthbind Totem <Энха-Ревущийфьорд>",
		[339550] = "[*] Echo of Battle",
		[345693] = 2,
		[108978] = 8,
		[334433] = 8,
		[269937] = 2,
		[93622] = 11,
		[343648] = 11,
		[320102] = 7,
		[212295] = 9,
		[261947] = 10,
		[345698] = 6,
		[97462] = 1,
		[329319] = "Mawsworn Sentry",
		[324202] = 5,
		[329322] = "Mawsworn Disciple",
		[97463] = 1,
		[222024] = 6,
		[259391] = 3,
		[335467] = 5,
		[329325] = "Mawsworn Soulbinder",
		[281209] = 6,
		[329326] = "Mawsworn Soulbinder",
		[194384] = 5,
		[8143] = 7,
		[81340] = 6,
		[320114] = "Xav the Unfallen",
		[222026] = 6,
		[328305] = 4,
		[62305] = "FIFI",
		[328306] = 4,
		[345710] = 3,
		[85948] = 6,
		[205648] = 7,
		[259395] = 1,
		[322167] = 9,
		[184662] = 2,
		[210256] = 2,
		[339573] = "Mordretha, the Endless Empress",
		[73920] = 7,
		[322170] = 9,
		[182104] = 2,
		[211793] = 6,
		[209746] = 11,
		[259398] = 3,
		[340600] = 4,
		[286342] = 10,
		[340601] = 4,
		[227151] = 4,
		[330366] = 2,
		[336509] = 5,
		[126389] = 6,
		[77761] = 11,
		[320130] = 8,
		[209749] = 11,
		[324226] = 11,
		[34026] = 3,
		[345727] = 10,
		[200025] = 2,
		[77762] = 7,
		[115129] = 10,
		[320137] = 7,
		[205146] = 9,
		[329352] = 6,
		[306830] = 12,
		[252751] = 7,
		[5760] = 4,
		[221527] = 12,
		[341639] = 12,
		[247121] = 12,
		[77764] = 11,
		[19577] = 3,
		[330380] = 3,
		[191840] = 10,
		[75973] = 10,
		[20153] = "Infernal <Хитомитанако-СвежевательДуш>",
		[206685] = "Spitting Cobra <Frobena-Draenor>",
		[114108] = 11,
		[118459] = "Centuria <Fridion>",
		[20473] = 2,
		[332431] = "Mawsworn Valuator",
		[211805] = 6,
		[101568] = 6,
		[318102] = "Xav the Unfallen",
		[307865] = 1,
		[132466] = 2,
		[119996] = 10,
		[132467] = 10,
		[30455] = 8,
		[53480] = 3,
		[116670] = 10,
		[307871] = 1,
		[109248] = 3,
		[207203] = 6,
		[27576] = 4,
		[294564] = 5,
		[263852] = "Raubvogel <Grunzi-FestungderStürme>",
		[166766] = "Mawsworn Shackler",
		[32375] = 5,
		[344732] = 5,
		[263856] = "koky",
		[16827] = "Skarr <Höpfchen-DieSilberneHand>",
		[261977] = 10,
		[263858] = "Wespe <Izek-Shattrath>",
		[324260] = 4,
		[114113] = 11,
		[213350] = 4,
		[59752] = 2,
		[51690] = 4,
		[263861] = "Thumper <Appollina>",
		[281265] = 5,
		[48107] = 8,
		[349857] = 5,
		[121536] = 5,
		[113858] = 9,
		[325289] = 9,
		[22842] = 11,
		[179057] = 12,
		[195949] = 5,
		[23034] = 2,
		[147833] = 1,
		[190319] = 8,
		[69070] = 9,
		[102342] = 11,
		[184689] = 2,
		[317103] = 2,
		[47468] = "Могилогорб <Стергим-Голдринн>",
		[343721] = 2,
		[48108] = 8,
		[148859] = 5,
		[113860] = 9,
		[343724] = 2,
		[345772] = "Fae Guardian <Transformerr-Khadgar>",
		[334511] = 12,
		[345773] = 8,
		[320180] = "Paceran the Virulent",
		[8512] = 7,
		[343727] = "Shadowfiend <Nâisha-DunModr>",
		[51052] = 6,
		[127170] = 1,
		[106951] = 11,
		[332468] = 1,
		[332469] = 1,
		[332470] = 1,
		[216431] = 3,
		[332471] = 1,
		[203123] = 11,
		[120517] = 5,
		[347829] = 1,
		[42223] = 9,
		[285381] = 11,
		[271049] = 3,
		[265931] = 9,
		[258920] = 12,
		[346811] = "Mawsworn Veteran",
		[316099] = 9,
		[258921] = 12,
		[5217] = 11,
		[346813] = "Tower Sentinel",
		[33778] = 11,
		[2641] = 3,
		[2649] = "Centuria <Fridion>",
		[263892] = "Leonidas",
		[319175] = 4,
		[207736] = 4,
		[314058] = 11,
		[331462] = 12,
		[199547] = 12,
		[2825] = 7,
		[209785] = 2,
		[339654] = 3,
		[5761] = 4,
		[205179] = 9,
		[205691] = 3,
		[198013] = 12,
		[327371] = 8,
		[126664] = 1,
		[73685] = 7,
		[205180] = 9,
		[336587] = 3,
		[345801] = 2,
		[204157] = 12,
		[336588] = 3,
		[267997] = "Vilefiend <Irmavep-Terokkar>",
		[24252] = 2,
		[188290] = 6,
		[267999] = "Vilefiend <Irmavep-Terokkar>",
		[199552] = 12,
		[108238] = 11,
		[340688] = 11,
		[102352] = 11,
		[242551] = 11,
		[336595] = 12,
		[330565] = "Ancient Captain",
		[339751] = "Echo Bullrider",
		[339706] = "Echo Bullrider",
		[324589] = "Deathwalker <[*] Manifest Death>",
		[307932] = 9,
		[333526] = 3,
		[163212] = 10,
		[339669] = 2,
		[6673] = 1,
		[323825] = "Grasping Rift <Mordretha, the Endless Empress>",
		[30153] = "Bleekvegen <Irmavep-Terokkar>",
		[193530] = 3,
		[170379] = 7,
		[329433] = 5,
		[220543] = 5,
		[208770] = 12,
		[332505] = 8,
		[3409] = 4,
		[324424] = "Mordretha, the Endless Empress",
		[323683] = "Mordretha, the Endless Empress",
		[332506] = 8,
		[323130] = "[*] Coagulating Ooze",
		[323542] = "Oozing Leftovers",
		[270058] = 12,
		[323406] = "[*] Jagged Gash",
		[263916] = "Centuria <Fridion>",
		[227847] = 1,
		[330614] = "Rancid Gasbag",
		[329706] = "Mawsworn Interceptor",
		[330703] = "Blighted Sludge-Spewer",
		[204165] = 6,
		[208772] = 5,
		[320224] = 8,
		[32379] = 5,
		[36213] = "Greater Earth Elemental <Kaarmos-Thrall>",
		[330697] = "Diseased Horror",
		[330700] = "Diseased Horror",
		[319521] = "Kul'tharok",
		[61295] = 7,
		[319765] = "Kul'tharok",
		[345805] = 2,
		[345804] = 2,
		[330875] = "Nefarious Darkspeaker",
		[247676] = 2,
		[333297] = "Nefarious Darkspeaker",
		[31230] = 4,
		[204167] = 6,
		[160029] = 11,
		[336608] = 7,
		[333708] = "Maniacal Soulbinder",
		[116768] = 10,
		[247677] = 2,
		[332514] = 3,
		[342675] = "Bone Magus",
		[326494] = 11,
		[285514] = 7,
		[331606] = "Oppressive Banner <Xav the Unfallen>",
		[331618] = "Xav the Unfallen",
		[320644] = "Xav the Unfallen",
		[316995] = "Xav the Unfallen",
		[317231] = "Xav the Unfallen",
		[288495] = 3,
		[331319] = "Dokigg the Brutalizer",
		[342125] = "Dokigg the Brutalizer",
		[197003] = 4,
		[331320] = "Dokigg the Brutalizer",
		[330532] = "Shambling Arbalest",
		[131894] = 3,
		[270332] = 3,
		[320277] = "Sathel the Accursed",
		[333292] = "Sathel the Accursed",
		[200587] = 9,
		[90328] = "Shadow <Shiryou-ColinasPardas>",
		[331016] = 12,
		[320120] = "Paceran the Virulent",
		[57841] = 4,
		[320235] = 11,
		[329449] = 2,
		[252071] = 11,
		[331497] = 12,
		[80313] = 11,
		[688] = 9,
		[206151] = 9,
		[202636] = 11,
		[333241] = "Raging Bloodhorn",
		[334196] = 7,
		[335904] = 7,
		[330896] = 9,
		[196414] = 9,
		[205708] = 8,
		[198030] = 12,
		[186257] = 3,
		[348904] = 2,
		[308509] = 11,
		[172] = 9,
		[333845] = "Rek the Hardened",
		[332525] = "Kyrian Goliath <Fridion>",
		[336996] = "Nekthara the Mangler",
		[105174] = 9,
		[327407] = 10,
		[332526] = "Kyrian Goliath <Fridion>",
		[331288] = "Heavin the Breaker",
		[98008] = 7,
		[102359] = 11,
		[333861] = "Harugia the Bloodthirsty",
		[331510] = "Unyielding Contender",
		[338670] = 2,
		[57842] = 4,
		[138130] = 10,
		[44521] = 8,
		[61336] = 11,
		[34914] = 5,
		[29166] = 11,
		[317221] = 2,
		[115192] = 4,
		[167119] = "Invasive Decayfly",
		[93402] = 11,
		[278326] = 12,
		[228532] = 12,
		[309554] = 2,
		[193475] = 2,
		[294701] = 5,
		[263642] = 12,
		[190356] = 8,
		[227723] = 3,
		[207760] = 12,
		[242900] = "Grounding Totem <Энха-Ревущийфьорд>",
		[108503] = 9,
		[320248] = "Paceran the Virulent",
		[205246] = 9,
		[323367] = 2,
		[190357] = 8,
		[344910] = 2,
		[6360] = "Домви",
		[77535] = 6,
		[213691] = "Вуддман-Гордунни",
		[246152] = 3,
		[31661] = 8,
		[342773] = 2,
		[210833] = 8,
		[203155] = 3,
		[17364] = 7,
		[191894] = 10,
		[280398] = 5,
		[279302] = 6,
		[17] = 5,
		[260798] = 1,
		[58867] = "Spirit Wolf <Энха-Ревущийфьорд>",
		[279303] = 6,
		[123254] = 5,
		[265157] = 3,
		[147362] = 3,
		[332539] = 2,
		[2098] = 4,
		[210323] = 2,
		[186265] = 3,
		[120696] = 5,
		[227255] = 12,
		[39800] = 6,
		[118905] = "Capacitor Totem <Energize-Ravencrest>",
		[312546] = 6,
		[163025] = 8,
		[210324] = 2,
		[44535] = 2,
		[336637] = "Amnoni",
		[337661] = 5,
		[201427] = 12,
		[321329] = 8,
		[53365] = 6,
		[338867] = "Nurgash Muckformed",
		[204331] = 7,
		[279569] = 1,
		[137639] = 10,
		[22482] = 4,
		[216468] = 11,
		[319236] = 6,
		[194249] = 5,
		[80353] = 8,
		[214975] = 6,
		[1329] = 4,
		[138213] = 4,
		[101643] = 10,
		[337709] = 6,
		[319238] = 6,
		[5394] = 7,
		[343312] = 12,
		[25912] = 2,
		[1953] = 8,
		[69395] = 6,
		[270248] = "Burning Emberguard",
		[118779] = 1,
		[102793] = 11,
		[287504] = 10,
		[80354] = 4,
		[200166] = 12,
		[186270] = 3,
		[332550] = "Shackled Soul",
		[186403] = 4,
		[236298] = 8,
		[290577] = "Abomination <Стергим-Голдринн>",
		[1719] = 1,
		[61684] = "Reban <Scproject-Aegwynn>",
		[22720] = 1,
		[319243] = 6,
		[11426] = 8,
		[190446] = 8,
		[1459] = 8,
		[311054] = 10,
		[194509] = 5,
		[1449] = 8,
		[59638] = 8,
		[319245] = 6,
		[335096] = 1,
		[207771] = 12,
		[86659] = 2,
		[853] = 2,
		[158176] = "Dusky Tremorbeast",
		[35546] = 4,
		[269083] = 4,
		[61425] = 5,
		[124121] = 11,
		[341770] = 7,
		[157153] = 7,
		[210152] = 12,
		[320272] = "Sathel the Accursed",
		[341771] = "Bone Magus",
		[110745] = 5,
		[338863] = "Nurgash Muckformed",
		[332092] = 11,
		[185123] = 12,
		[330511] = 11,
		[116095] = 10,
		[91776] = "Могилогорб",
		[296748] = "Massive Crusher",
		[185763] = 4,
		[212680] = 3,
		[304971] = 2,
		[49184] = 6,
		[298831] = "Mawsworn Sentry",
		[331537] = "Shadowgrasp Totem <Sêréna-Aegwynn>",
		[28880] = 1,
		[122] = 8,
		[5225] = 11,
		[46585] = 6,
		[34428] = 1,
		[345464] = 4,
		[345093] = 2,
		[327907] = 2,
		[134359] = 5,
		[337682] = 2,
		[195292] = 6,
		[319255] = 6,
		[319190] = 4,
		[116189] = 10,
		[139546] = 4,
		[196819] = 4,
		[7384] = 1,
		[329548] = 9,
		[42776] = 5,
		[130138] = 8,
		[256374] = 9,
		[135700] = 11,
		[121471] = 4,
		[77575] = 6,
		[154953] = 4,
		[18562] = 11,
		[202147] = 1,
		[325464] = 6,
		[97547] = 11,
		[298841] = 6,
		[6770] = 4,
		[278310] = 8,
		[33917] = 11,
		[311494] = 12,
		[184575] = 2,
		[201428] = 12,
		[207267] = 6,
		[475] = 8,
		[229976] = "Nàarûna-Rexxar",
		[93326] = 8,
		[203277] = 8,
		[198103] = 7,
		[31935] = 2,
		[100] = 1,
		[70890] = 6,
		[329666] = 3,
		[204197] = 5,
		[324073] = 4,
		[198837] = "Risen Skulker <Trippor-Thrall>",
		[123904] = 10,
		[155722] = 11,
		[266030] = 9,
		[185311] = 4,
		[325461] = 6,
		[289577] = 5,
		[330067] = 7,
		[207317] = 6,
		[156910] = 2,
		[122470] = 10,
		[259277] = "Ralf",
		[346369] = 1,
		[345361] = 12,
		[342814] = 11,
		[257946] = 3,
		[164273] = 3,
		[1833] = 4,
		[160124] = "Pisdez",
		[208086] = 1,
		[320293] = "Sathel the Accursed",
		[345423] = 12,
		[16191] = 7,
		[338141] = 10,
		[585] = 5,
		[317223] = 2,
		[342817] = 12,
		[206760] = 4,
		[187874] = 7,
		[329563] = "Dusky Tremorbeast",
		[228361] = 5,
		[116705] = 10,
		[311499] = 12,
		[142073] = 5,
		[204301] = 2,
		[24244] = "Underfoot",
		[231843] = 2,
		[228260] = 5,
		[336642] = 1,
		[263854] = "Reban <Scproject-Aegwynn>",
		[18499] = 1,
		[197548] = 5,
		[308495] = 3,
		[316262] = 5,
		[345432] = 3,
		[211881] = 12,
		[331523] = 7,
		[96231] = 2,
		[320300] = "Sathel the Accursed",
		[263423] = "FIFI",
		[84714] = 8,
		[327467] = "Custodian Thonar",
		[143924] = 6,
		[31616] = 7,
		[205191] = 2,
		[189877] = 11,
		[308491] = 3,
		[193455] = 3,
		[5176] = 11,
		[186289] = 3,
		[334693] = 6,
		[183218] = 2,
		[343393] = 8,
		[49576] = 6,
		[157503] = 7,
		[193456] = 12,
		[239013] = 2,
		[327471] = "Custodian Thonar",
		[208645] = 12,
		[24450] = "Katze <Muji-Nathrezim>",
		[49020] = 6,
		[2050] = 5,
		[45181] = 4,
		[53351] = 3,
		[259489] = 3,
		[3411] = 1,
		[300147] = 9,
		[199600] = 4,
		[187827] = 12,
		[339759] = "Mordretha, the Endless Empress",
		[205231] = "Darkglare <Супербывшая-Ревущийфьорд>",
		[224729] = 6,
		[336746] = 3,
		[300728] = 1,
		[332594] = 2,
		[126434] = 6,
		[110310] = 10,
		[290213] = 11,
		[11327] = 4,
		[270338] = 3,
		[259491] = 3,
		[227034] = 11,
		[319233] = 6,
		[91800] = "Hammerface",
		[102547] = 11,
		[596] = 5,
		[129250] = 5,
		[337716] = 5,
		[198067] = 7,
		[255909] = 4,
		[54680] = "Mutyur <Zoanel-Ravencrest>",
		[199603] = 4,
		[342774] = 11,
		[323385] = 2,
		[45182] = 4,
		[310143] = 8,
		[57723] = 11,
		[202497] = 11,
		[316220] = 4,
		[106898] = 11,
		[338804] = 12,
		[210294] = 2,
		[342938] = 9,
		[703] = 4,
		[198069] = 5,
		[58875] = 7,
		[34433] = 5,
		[204263] = 5,
		[274837] = 2,
		[328275] = 3,
		[50842] = 6,
		[325437] = 8,
		[259495] = 3,
		[116011] = 8,
		[307443] = 8,
		[270241] = "Burning Emberguard",
		[204213] = 5,
		[8690] = 6,
		[280776] = 1,
		[21562] = 5,
		[202166] = 1,
		[45470] = 6,
		[326059] = 7,
		[206930] = 6,
		[171454] = 3,
		[20484] = 11,
		[228579] = 6,
		[45438] = 8,
		[157122] = 2,
		[87023] = 8,
		[344067] = 2,
		[119914] = 9,
		[77220] = 9,
		[335680] = "Mawsworn Soulweaver",
		[129253] = "Pugzy-Silvermoon",
		[325443] = 8,
		[202168] = 1,
		[343294] = 6,
		[340056] = 11,
		[240559] = "[*] Grievous Wound",
		[191587] = 6,
		[185394] = 3,
		[50401] = 6,
		[201657] = 11,
		[186387] = 3,
		[87024] = 8,
		[162243] = 12,
		[341826] = 5,
		[171457] = 3,
		[228583] = 6,
		[305049] = 2,
		[702] = 9,
		[84721] = 8,
		[44544] = 8,
		[207289] = "Carvon-Drak'thul",
		[329543] = 5,
		[206966] = 12,
		[176065] = "Dusky Tremorbeast",
		[344900] = 2,
		[197625] = 11,
		[330131] = 8,
		[214968] = 6,
		[158221] = 10,
		[334058] = 8,
		[327574] = 6,
		[327498] = 8,
		[336891] = 10,
		[740] = 11,
		[5938] = 4,
		[198589] = 12,
		[57755] = 1,
		[783] = 11,
		[41635] = 5,
		[203958] = 11,
		[187650] = 3,
		[43265] = 6,
		[342857] = 12,
		[298836] = 11,
		[157128] = 2,
		[340467] = 6,
		[64380] = 1,
		[209426] = 12,
		[86949] = 8,
		[117014] = 7,
		[345495] = "Frothing Pustule",
		[199844] = 8,
		[171850] = 4,
		[321444] = 7,
		[974] = 7,
		[176069] = "Invasive Decayfly",
		[20549] = 1,
		[325028] = 3,
		[1604] = "Wild Gormling",
		[23033] = 3,
		[344909] = "[*] Splintered Heart of Al'ar",
		[337824] = 2,
		[215802] = 7,
		[176070] = "Invasive Decayfly",
		[328530] = 5,
		[329127] = 10,
		[157131] = 2,
		[323498] = 2,
		[8613] = 2,
		[102560] = 11,
		[58984] = 10,
		[245686] = 4,
		[343011] = 12,
		[115181] = 10,
		[198817] = 1,
		[157644] = 8,
		[228600] = 8,
		[256948] = 3,
		[108271] = 7,
		[290754] = 11,
		[118297] = "Primal Fire Elemental <Pumpactionz-TarrenMill>",
		[15487] = 5,
		[91797] = "Tombmonger",
		[235450] = 8,
		[338864] = "Nurgash Muckformed",
		[337749] = 5,
		[69369] = 11,
		[232698] = 5,
		[6552] = 1,
		[164812] = 11,
		[51490] = 7,
		[117405] = 3,
		[342314] = 11,
		[2061] = 5,
		[183752] = 12,
		[32182] = 7,
		[96499] = 2,
		[334776] = 3,
		[330586] = "Putrid Butcher",
		[237838] = "Spitting Cobra <Дочьинженера-Дракономор>",
		[26297] = 3,
		[288613] = 3,
		[232893] = 12,
		[274281] = 11,
		[203533] = 11,
		[329564] = "Dusky Tremorbeast",
		[5211] = 11,
		[274282] = 11,
		[23035] = 9,
		[228287] = 10,
		[64382] = 1,
		[274283] = 11,
		[315341] = 4,
		[164815] = 11,
		[212084] = 12,
		[157736] = 9,
		[25914] = 2,
		[24858] = 11,
		[321529] = 8,
		[122783] = 10,
		[324449] = "Mordretha, the Endless Empress",
		[338865] = "Soulstalker V'lara",
		[330592] = "Rancid Gasbag",
		[307046] = 12,
		[57984] = "Primal Fire Elemental <Pumpactionz-TarrenMill>",
		[101546] = 10,
		[260734] = 7,
		[266779] = 3,
		[31224] = 4,
		[307166] = 7,
		[982] = 3,
		[190411] = 1,
		[328547] = 4,
		[203720] = 12,
		[146739] = 9,
		[3714] = 6,
		[48743] = 6,
		[240263] = 9,
		[199450] = 2,
		[51714] = 6,
		[231435] = 2,
		[132157] = 5,
		[212423] = "Risen Skulker <Trippor-Thrall>",
		[196555] = 12,
		[334275] = "Хитомитанако-СвежевательДуш",
		[140249] = 3,
		[338788] = 2,
		[207386] = 11,
		[8178] = 7,
		[305005] = 2,
		[254224] = 5,
		[331623] = 9,
		[212327] = 9,
		[114089] = 7,
		[226757] = 8,
		[331624] = 2,
		[108211] = 4,
		[8676] = 4,
		[29722] = 9,
		[335720] = "Mawsworn Ritualist",
		[196911] = 4,
		[19647] = "Зоррик",
		[205345] = 8,
		[323436] = 3,
		[120360] = 3,
		[32409] = "[*] Shadow Word: Death",
		[216521] = 10,
		[77758] = 11,
		[90361] = "Shadow <Shiryou-ColinasPardas>",
		[49322] = 5,
		[308239] = 2,
		[153561] = 8,
		[73921] = 7,
		[289308] = 8,
		[199721] = 6,
		[75] = 3,
		[324463] = 6,
		[222241] = 2,
		[204330] = 7,
		[255937] = 2,
		[162264] = 12,
		[216869] = 2,
		[205202] = 2,
		[188370] = 2,
		[12323] = 1,
		[116706] = 10,
		[33786] = 11,
		[48045] = 5,
		[45297] = 7,
		[207150] = 6,
		[107574] = 1,
		[197835] = 4,
		[308087] = 1,
		[328204] = 2,
		[198097] = 4,
		[228478] = 12,
		[207311] = 6,
		[97341] = 11,
		[334864] = 2,
		[328900] = 6,
		[292903] = "Mawsworn Guard",
		[51460] = 6,
		[29893] = 9,
		[186263] = 5,
		[202127] = 10,
		[95738] = 1,
		[212431] = 3,
		[167898] = 4,
		[81141] = 6,
		[292910] = "Mawsworn Shackler",
		[48517] = 11,
		[255941] = 2,
		[124507] = 10,
		[193358] = 4,
		[204242] = 2,
		[290512] = 10,
		[205629] = "Rhux-Drak'thul",
		[344245] = 5,
		[296140] = 2,
		[266120] = "Rotbriar Boggart",
		[260643] = 1,
		[99] = 11,
		[108280] = 7,
		[193359] = 4,
		[115008] = 10,
		[25504] = 7,
		[334713] = "Dreadstalker <Irmavep-Terokkar>",
		[206803] = 12,
		[115546] = 10,
		[207167] = 6,
		[192081] = 11,
		[311490] = 2,
		[110909] = 8,
		[115191] = 4,
		[311489] = 2,
		[206804] = 12,
		[47750] = 5,
		[337787] = "Tramux-Thrall",
		[322431] = 5,
		[14914] = 5,
		[3355] = 3,
		[20707] = 9,
		[48518] = 11,
		[113656] = 10,
		[344955] = 6,
		[32645] = 4,
		[311486] = 3,
		[311484] = 2,
		[121147] = 6,
		[345980] = 6,
		[327225] = 2,
		[48438] = 11,
		[19801] = 3,
		[223306] = 2,
		[54149] = 2,
		[288849] = 6,
		[125174] = 10,
		[323764] = 11,
		[132463] = 10,
		[104773] = 9,
		[336045] = 1,
		[78675] = 11,
		[114255] = 5,
		[117952] = 10,
		[63619] = "Shadowfiend <Вайтмайн-ВечнаяПесня>",
		[55090] = 6,
		[271971] = "Dreadstalker <Irmavep-Terokkar>",
		[326731] = 2,
		[341572] = 4,
		[118] = 8,
		[345667] = 2,
		[313948] = 7,
		[312202] = 6,
		[311479] = 8,
		[339538] = 2,
		[185438] = 4,
		[123586] = 10,
		[49143] = 6,
		[232523] = 4,
		[344228] = 7,
		[94463] = 8,
		[329608] = "Runecarved Colossus",
		[11366] = 8,
		[327851] = "Amieka",
		[8004] = 7,
		[329609] = "Runecarved Colossus",
		[105421] = 2,
		[35395] = 2,
		[258883] = 12,
		[102351] = 11,
		[223829] = 6,
		[315585] = 4,
		[322729] = 10,
		[232405] = 7,
		[258634] = "Burning Emberguard",
		[75614] = 2,
		[288438] = 3,
		[185313] = 4,
		[82691] = 8,
		[6789] = 9,
		[213858] = 1,
		[305043] = 2,
		[320125] = 7,
		[155625] = 11,
		[196718] = 12,
		[32390] = 9,
		[44425] = 8,
		[186258] = 3,
		[30213] = "Bleekvegen <Irmavep-Terokkar>",
		[36554] = 4,
		[285594] = 10,
		[12294] = 1,
		[52212] = 6,
		[115196] = 4,
		[196980] = 4,
		[199027] = 4,
		[194679] = 6,
		[341902] = "Battlefield Ritualist",
		[204255] = 12,
		[17962] = 9,
		[336009] = 5,
		[213981] = 4,
		[223341] = 10,
		[323476] = 4,
		[137619] = 4,
		[162794] = 12,
		[8679] = 4,
		[311464] = 9,
		[195457] = 4,
		[323707] = 5,
		[292473] = 11,
		[303003] = 11,
		[158188] = 4,
		[88423] = 11,
		[30151] = "Bleekvegen <Irmavep-Terokkar>",
		[188389] = 7,
		[48265] = 6,
		[213983] = 4,
		[203651] = 11,
		[310454] = 10,
		[72968] = 3,
		[258922] = 12,
		[187878] = 7,
		[208771] = 5,
		[114942] = "Healing Tide Totem <Zärby-Ambossar>",
		[210053] = 11,
		[47541] = 6,
		[225921] = 12,
		[336791] = 12,
		[171846] = 6,
		[320976] = 3,
		[6788] = 5,
		[208790] = 12,
		[320221] = 8,
		[155158] = 8,
		[328923] = 7,
		[342998] = 5,
		[163505] = 11,
		[119910] = 9,
		[102383] = 11,
		[1079] = 11,
		[201633] = 7,
		[198819] = 1,
		[231390] = 3,
		[23881] = 1,
		[337819] = 12,
		[322463] = 5,
		[245723] = 2,
		[285452] = 7,
		[2818] = 4,
		[199854] = 1,
		[285466] = 7,
		[48778] = 6,
		[294171] = "Mawsworn Interceptor",
		[109304] = 3,
	},
	["encounter_spell_pool"] = {
		{
			2391, -- [1]
			"Dessia the Decapitator", -- [2]
		}, -- [1]
		[339759] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[322088] = {
			2364, -- [1]
			"Kul'tharok", -- [2]
		},
		[320277] = {
			2391, -- [1]
			"Sathel the Accursed", -- [2]
		},
		[320293] = {
			2391, -- [1]
			"Sathel the Accursed", -- [2]
		},
		[320120] = {
			2391, -- [1]
			"Paceran the Virulent", -- [2]
		},
		[331618] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[339415] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[323681] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[319539] = {
			2364, -- [1]
			"Kul'tharok", -- [2]
		},
		[320248] = {
			2391, -- [1]
			"Paceran the Virulent", -- [2]
		},
		[339550] = {
			2404, -- [1]
			"[*] Echo of Battle", -- [2]
		},
		[323608] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[318406] = {
			2365, -- [1]
			"Gorechop", -- [2]
		},
		[339706] = {
			2404, -- [1]
			"Echo Bullrider", -- [2]
		},
		[324589] = {
			2404, -- [1]
			"Deathwalker <[*] Manifest Death>", -- [2]
		},
		[323683] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[323825] = {
			2404, -- [1]
			"Grasping Rift <Mordretha, the Endless Empress>", -- [2]
		},
		[324514] = {
			2404, -- [1]
			"[*] Manifest Death", -- [2]
		},
		[320644] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[339573] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[240559] = {
			2391, -- [1]
			"[*] Grievous Wound", -- [2]
		},
		[333292] = {
			2391, -- [1]
			"Sathel the Accursed", -- [2]
		},
		[319637] = {
			2364, -- [1]
			"[*] Reclaimed Soul", -- [2]
		},
		[324424] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[324079] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[320063] = {
			2391, -- [1]
			"Dessia the Decapitator", -- [2]
		},
		[3110] = {
			2365, -- [1]
			"Dagbis <Makaveliuk-Moonglade>", -- [2]
		},
		[339751] = {
			2404, -- [1]
			"Echo Bullrider", -- [2]
		},
		[320300] = {
			2391, -- [1]
			"Sathel the Accursed", -- [2]
		},
		[333231] = {
			2391, -- [1]
			"Sathel the Accursed", -- [2]
		},
		[319765] = {
			2364, -- [1]
			"Kul'tharok", -- [2]
		},
		[320789] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[323750] = {
			2365, -- [1]
			"[*] Vile Gas", -- [2]
		},
		[323130] = {
			2365, -- [1]
			"[*] Coagulating Ooze", -- [2]
		},
		[52042] = {
			2391, -- [1]
			"Healing Stream Totem <Azurr-Outland>", -- [2]
		},
		[323542] = {
			2365, -- [1]
			"Oozing Leftovers", -- [2]
		},
		[320050] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[317231] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[316995] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[323107] = {
			2365, -- [1]
			"Oozing Leftovers", -- [2]
		},
		[320114] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[327942] = {
			2366, -- [1]
			"Windfury Totem <Azurr-Outland>", -- [2]
		},
		[320272] = {
			2391, -- [1]
			"Sathel the Accursed", -- [2]
		},
		[320729] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[323406] = {
			2365, -- [1]
			"[*] Jagged Gash", -- [2]
		},
		[316981] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[323515] = {
			2365, -- [1]
			"Gorechop", -- [2]
		},
		[319626] = {
			2364, -- [1]
			"Kul'tharok", -- [2]
		},
		[324085] = {
			2391, -- [1]
			"Dessia the Decapitator", -- [2]
		},
		[320069] = {
			2391, -- [1]
			"Dessia the Decapitator", -- [2]
		},
		[319521] = {
			2364, -- [1]
			"Kul'tharok", -- [2]
		},
		[331606] = {
			2366, -- [1]
			"Oppressive Banner <Xav the Unfallen>", -- [2]
		},
		[320180] = {
			2391, -- [1]
			"Paceran the Virulent", -- [2]
		},
		[326892] = {
			2391, -- [1]
			"Dessia the Decapitator", -- [2]
		},
		[323110] = {
			2365, -- [1]
			"Oozing Leftovers", -- [2]
		},
		[324449] = {
			2404, -- [1]
			"Mordretha, the Endless Empress", -- [2]
		},
		[318102] = {
			2366, -- [1]
			"Xav the Unfallen", -- [2]
		},
		[343553] = {
			2391, -- [1]
			"Spiteful Shade", -- [2]
		},
	},
	["immersion_pets_on_solo_play"] = false,
	["npcid_ignored"] = {
	},
	["dungeon_data"] = {
	},
	["auto_open_news_window"] = true,
	["got_first_run"] = true,
	["__profiles"] = {
		["Relaeya-Argent Dawn"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["ocd_tracker"] = {
				["enabled"] = false,
				["cooldowns"] = {
				},
				["show_conditions"] = {
					["only_inside_instance"] = true,
					["only_in_group"] = true,
				},
				["pos"] = {
				},
				["show_options"] = false,
			},
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["maximize_method"] = 1,
				["fontshadow"] = false,
				["border_size"] = 14,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = true,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["fontstrings_width"] = 35,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["show_timer"] = true,
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
					},
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["icon_desaturated"] = false,
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["menu_icons_alpha"] = 0.5,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 70,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 3,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 1,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 2,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
					},
					["bars_inverted"] = false,
					["version"] = 3,
					["switch_tank_in_combat"] = false,
					["bg_alpha"] = 0.183960914611816,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["backdrop_texture"] = "Details Ground",
					["stretch_button_side"] = 1,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["plugins_grow_direction"] = 1,
					["hide_in_combat_alpha"] = 0,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Interface\\Addons\\Details\\fonts\\Accidental Presidency.ttf",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["font_size"] = 16,
						["textL_translit_text"] = false,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\BigWigs\\Media\\Textures\\BantoBar",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["textR_enable_custom_text"] = false,
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["texture_custom"] = "",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["start_after_icon"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["texture_background"] = "Details D'ictum (reverse)",
						["alpha"] = 1,
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["texture_custom_file"] = "Interface\\",
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["libwindow"] = {
						["y"] = 1.52587890625e-05,
						["x"] = 0,
						["point"] = "CENTER",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["bars_grow_direction"] = 1,
					["clickthrough_rows"] = false,
					["desaturated_menu"] = false,
					["micro_displays_side"] = 2,
					["switch_damager_in_combat"] = false,
					["ignore_mass_showhide"] = false,
					["skin_custom"] = "",
					["auto_current"] = true,
					["bars_sort_direction"] = 1,
					["grab_on_top"] = false,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["menu_icons_size"] = 0.850000023841858,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["hide_in_combat_type"] = 1,
					["fontstrings_text3_anchor"] = 35,
					["use_multi_fontstrings"] = false,
					["__was_opened"] = true,
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["overall_clear_newboss"] = true,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["time_type_original"] = 2,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["trash_auto_remove"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["broadcaster_enabled"] = false,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
			},
			["default_bg_color"] = 0.0941,
			["segments_panic_mode"] = false,
			["report_heal_links"] = false,
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["minimum_combat_time"] = 5,
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["standard_skin"] = false,
		},
		["Hikarü-Twisting Nether"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["ocd_tracker"] = {
				["enabled"] = false,
				["cooldowns"] = {
				},
				["show_conditions"] = {
					["only_inside_instance"] = true,
					["only_in_group"] = true,
				},
				["pos"] = {
				},
				["show_options"] = false,
			},
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = true,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["menu_icons_size"] = 0.850000023841858,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["fontstrings_width"] = 35,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["clickthrough_rows"] = false,
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["icon_desaturated"] = false,
					["switch_damager"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["menu_icons_alpha"] = 0.5,
					["bg_b"] = 0.0941176470588235,
					["backdrop_texture"] = "Details Ground",
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 70,
					["StatusBarSaved"] = {
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 1,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 1,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 1,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
					},
					["__was_opened"] = true,
					["bg_alpha"] = 0.183960914611816,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["version"] = 3,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["clickthrough_window"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["stretch_button_side"] = 1,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["ignore_mass_showhide"] = false,
					["hide_in_combat_alpha"] = 0,
					["hide_in_combat_type"] = 1,
					["fontstrings_text3_anchor"] = 35,
					["libwindow"] = {
						["y"] = 1.52587890625e-05,
						["x"] = 0,
						["point"] = "CENTER",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["bars_grow_direction"] = 1,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["bars_sort_direction"] = 1,
					["grab_on_top"] = false,
					["switch_damager_in_combat"] = false,
					["bars_inverted"] = false,
					["micro_displays_side"] = 2,
					["auto_current"] = true,
					["skin_custom"] = "",
					["desaturated_menu"] = false,
					["switch_all_roles_after_wipe"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["textL_enable_custom_text"] = false,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Interface\\Addons\\Details\\fonts\\Accidental Presidency.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["font_size"] = 16,
						["textL_translit_text"] = false,
						["height"] = 21,
						["texture_file"] = "Interface\\AddOns\\BigWigs\\Media\\Textures\\BantoBar",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["percent_type"] = 1,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textR_bracket"] = "(",
						["use_spec_icons"] = true,
						["textR_enable_custom_text"] = false,
						["texture_custom_file"] = "Interface\\",
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["texture_custom"] = "",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["start_after_icon"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textL_outline_small"] = true,
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
					},
					["attribute_text"] = {
						["show_timer"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["enabled"] = true,
						["enable_custom_text"] = false,
						["text_size"] = 12,
					},
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_tank_in_combat"] = false,
					["show_sidebars"] = false,
					["use_multi_fontstrings"] = false,
					["switch_healer_in_combat"] = false,
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["overall_clear_newboss"] = true,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["minimum_combat_time"] = 5,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["font_sizes"] = {
				["menus"] = 10,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["time_type_original"] = 2,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["total_abbreviation"] = 2,
			["animation_speed_triggertravel"] = 5,
			["clear_graphic"] = true,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
			},
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["broadcaster_enabled"] = false,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["segments_amount_to_save"] = 18,
			["trash_auto_remove"] = true,
			["default_bg_color"] = 0.0941,
			["segments_panic_mode"] = false,
			["report_heal_links"] = false,
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["overall_clear_logout"] = false,
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["standard_skin"] = false,
		},
		["Kereldude-Argent Dawn"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = true,
			["ocd_tracker"] = {
				["enabled"] = false,
				["cooldowns"] = {
				},
				["show_conditions"] = {
					["only_inside_instance"] = true,
					["only_in_group"] = true,
				},
				["pos"] = {
				},
				["show_options"] = false,
			},
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 13,
					["H"] = 13,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8697, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["fontshadow"] = false,
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["border_size"] = 14,
				["maximize_method"] = 1,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.2,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["instances_segments_locked"] = true,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["deadlog_limit"] = 16,
			["instances_no_libwindow"] = false,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 18,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["show_statusbar"] = false,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						16, -- [1]
						0, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0.0941176470588235,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["fontstrings_width"] = 35,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 12,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-18, -- [1]
							3, -- [2]
						},
						["show_timer"] = true,
						["enable_custom_text"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
					},
					["switch_tank"] = false,
					["switch_all_roles_after_wipe"] = false,
					["icon_desaturated"] = false,
					["switch_damager"] = false,
					["show_sidebars"] = false,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0941176470588235,
					["menu_icons_alpha"] = 0.5,
					["bg_b"] = 0.0941176470588235,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.0705882352941177, -- [1]
						0.0705882352941177, -- [2]
						0.0705882352941177, -- [3]
						0.639196664094925, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Minimalistic",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 70,
					["StatusBarSaved"] = {
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 3,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 1,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
								["textAlign"] = 2,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 1,
							},
						},
					},
					["__was_opened"] = true,
					["bg_alpha"] = 0.183960914611816,
					["switch_tank_in_combat"] = false,
					["version"] = 3,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["fontstrings_text3_anchor"] = 35,
					["hide_in_combat_type"] = 1,
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["plugins_grow_direction"] = 1,
					["hide_in_combat_alpha"] = 0,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["menu_icons_size"] = 0.850000023841858,
					["libwindow"] = {
						["y"] = 1.52587890625e-05,
						["x"] = 0,
						["point"] = "CENTER",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.3777777777777,
						["overlay"] = {
							0.333333333333333, -- [1]
							0.333333333333333, -- [2]
							0.333333333333333, -- [3]
						},
					},
					["bars_grow_direction"] = 1,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["clickthrough_rows"] = false,
					["menu_anchor_down"] = {
						16, -- [1]
						-3, -- [2]
					},
					["switch_damager_in_combat"] = false,
					["grab_on_top"] = false,
					["bars_sort_direction"] = 1,
					["skin_custom"] = "",
					["auto_current"] = true,
					["ignore_mass_showhide"] = false,
					["micro_displays_side"] = 2,
					["desaturated_menu"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = 0,
							["x"] = 0,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["percent_type"] = 1,
						["fixed_text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Interface\\Addons\\Details\\fonts\\Accidental Presidency.ttf",
						["textL_custom_text"] = "{data1}. {data3}{data2}",
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.5,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_translit_text"] = false,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\BigWigs\\Media\\Textures\\BantoBar",
						["font_size"] = 16,
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 12,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["use_spec_icons"] = true,
						["textR_bracket"] = "(",
						["textR_enable_custom_text"] = false,
						["textL_enable_custom_text"] = false,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
						},
						["textL_show_number"] = true,
						["texture_custom"] = "",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "BantoBar",
						["start_after_icon"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4_reverse",
						["textR_class_colors"] = false,
						["alpha"] = 1,
						["textL_class_colors"] = false,
						["texture_background"] = "Details D'ictum (reverse)",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							0.150228589773178, -- [4]
						},
						["font_face"] = "Accidental Presidency",
						["texture_class_colors"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							false, -- [3]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = "NONE",
						["height"] = 21,
					},
					["wallpaper"] = {
						["enabled"] = false,
						["texcoord"] = {
							0, -- [1]
							1, -- [2]
							0, -- [3]
							0.7, -- [4]
						},
						["overlay"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["anchor"] = "all",
						["height"] = 114.042518615723,
						["alpha"] = 0.5,
						["width"] = 283.000183105469,
					},
					["stretch_button_side"] = 1,
					["backdrop_texture"] = "Details Ground",
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["use_multi_fontstrings"] = false,
					["bars_inverted"] = false,
				}, -- [1]
			},
			["report_lines"] = 5,
			["use_battleground_server_parser"] = false,
			["use_scroll"] = false,
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["report_schema"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["overall_clear_newboss"] = true,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["overall_clear_logout"] = false,
			["memory_threshold"] = 3,
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["deadlog_events"] = 32,
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["time_type_original"] = 2,
			["disable_alldisplays_window"] = false,
			["numerical_system_symbols"] = "auto",
			["trash_auto_remove"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["segments_auto_erase"] = 1,
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["animation_speed_triggertravel"] = 5,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 18,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 220,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["deny_score_messages"] = false,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["broadcaster_enabled"] = false,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["default_bg_color"] = 0.0941,
			["segments_panic_mode"] = false,
			["report_heal_links"] = false,
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["minimum_combat_time"] = 5,
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 2,
			["default_bg_alpha"] = 0.5,
			["standard_skin"] = false,
		},
		["Chinees-Twisting Nether"] = {
			["show_arena_role_icon"] = false,
			["capture_real"] = {
				["heal"] = true,
				["spellcast"] = true,
				["miscdata"] = true,
				["aura"] = true,
				["energy"] = true,
				["damage"] = true,
			},
			["row_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["streamer_config"] = {
				["faster_updates"] = false,
				["quick_detection"] = false,
				["reset_spec_cache"] = false,
				["no_alerts"] = false,
				["disable_mythic_dungeon"] = false,
				["use_animation_accel"] = true,
			},
			["all_players_are_group"] = false,
			["use_row_animations"] = false,
			["report_heal_links"] = false,
			["remove_realm_from_name"] = true,
			["minimum_overall_combat_time"] = 10,
			["event_tracker"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["line_height"] = 16,
				["line_color"] = {
					0.1, -- [1]
					0.1, -- [2]
					0.1, -- [3]
					0.3, -- [4]
				},
				["font_shadow"] = "NONE",
				["font_size"] = 10,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = true,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0.16, -- [1]
						0.16, -- [2]
						0.16, -- [3]
						0.47, -- [4]
					},
					["locked"] = false,
					["height"] = 300,
					["width"] = 250,
				},
				["line_texture"] = "Details Serenity",
				["options_frame"] = {
				},
			},
			["report_to_who"] = "",
			["class_specs_coords"] = {
				[62] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[63] = {
					0.375, -- [1]
					0.5, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[250] = {
					0, -- [1]
					0.125, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[251] = {
					0.125, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[252] = {
					0.25, -- [1]
					0.375, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[253] = {
					0.875, -- [1]
					1, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[254] = {
					0, -- [1]
					0.125, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[255] = {
					0.125, -- [1]
					0.25, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[66] = {
					0.125, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[257] = {
					0.5, -- [1]
					0.625, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[258] = {
					0.6328125, -- [1]
					0.75, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[259] = {
					0.75, -- [1]
					0.875, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[260] = {
					0.875, -- [1]
					1, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[577] = {
					0.25, -- [1]
					0.375, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[262] = {
					0.125, -- [1]
					0.25, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[581] = {
					0.375, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[264] = {
					0.375, -- [1]
					0.5, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[265] = {
					0.5, -- [1]
					0.625, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[266] = {
					0.625, -- [1]
					0.75, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[267] = {
					0.75, -- [1]
					0.875, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[268] = {
					0.625, -- [1]
					0.75, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[269] = {
					0.875, -- [1]
					1, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[270] = {
					0.75, -- [1]
					0.875, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[70] = {
					0.251953125, -- [1]
					0.375, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[102] = {
					0.375, -- [1]
					0.5, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[71] = {
					0.875, -- [1]
					1, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[103] = {
					0.5, -- [1]
					0.625, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[72] = {
					0, -- [1]
					0.125, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[104] = {
					0.625, -- [1]
					0.75, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[73] = {
					0.125, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.625, -- [4]
				},
				[64] = {
					0.5, -- [1]
					0.625, -- [2]
					0.125, -- [3]
					0.25, -- [4]
				},
				[105] = {
					0.75, -- [1]
					0.875, -- [2]
					0, -- [3]
					0.125, -- [4]
				},
				[65] = {
					0, -- [1]
					0.125, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[256] = {
					0.375, -- [1]
					0.5, -- [2]
					0.25, -- [3]
					0.375, -- [4]
				},
				[261] = {
					0, -- [1]
					0.125, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
				[263] = {
					0.25, -- [1]
					0.375, -- [2]
					0.375, -- [3]
					0.5, -- [4]
				},
			},
			["profile_save_pos"] = true,
			["tooltip"] = {
				["header_statusbar"] = {
					0.3, -- [1]
					0.3, -- [2]
					0.3, -- [3]
					0.8, -- [4]
					false, -- [5]
					false, -- [6]
					"WorldState Score", -- [7]
				},
				["fontcolor_right"] = {
					1, -- [1]
					0.7, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["line_height"] = 17,
				["tooltip_max_targets"] = 2,
				["icon_size"] = {
					["W"] = 17,
					["H"] = 17,
				},
				["tooltip_max_pets"] = 2,
				["anchor_relative"] = "top",
				["abbreviation"] = 2,
				["anchored_to"] = 1,
				["show_amount"] = false,
				["header_text_color"] = {
					1, -- [1]
					0.9176, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["fontsize"] = 10,
				["background"] = {
					0.196, -- [1]
					0.196, -- [2]
					0.196, -- [3]
					0.8, -- [4]
				},
				["submenu_wallpaper"] = true,
				["fontsize_title"] = 10,
				["fontcolor"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["commands"] = {
				},
				["tooltip_max_abilities"] = 6,
				["fontface"] = "Friz Quadrata TT",
				["border_color"] = {
					0, -- [1]
					0, -- [2]
					0, -- [3]
					1, -- [4]
				},
				["border_texture"] = "Details BarBorder 3",
				["anchor_offset"] = {
					0, -- [1]
					0, -- [2]
				},
				["menus_bg_texture"] = "Interface\\SPELLBOOK\\Spellbook-Page-1",
				["maximize_method"] = 1,
				["border_size"] = 14,
				["fontshadow"] = false,
				["anchor_screen_pos"] = {
					507.7, -- [1]
					-350.5, -- [2]
				},
				["anchor_point"] = "bottom",
				["menus_bg_coords"] = {
					0.309777336120606, -- [1]
					0.924000015258789, -- [2]
					0.213000011444092, -- [3]
					0.279000015258789, -- [4]
				},
				["icon_border_texcoord"] = {
					["R"] = 0.921875,
					["L"] = 0.078125,
					["T"] = 0.078125,
					["B"] = 0.921875,
				},
				["menus_bg_color"] = {
					0.8, -- [1]
					0.8, -- [2]
					0.8, -- [3]
					0.2, -- [4]
				},
			},
			["ps_abbreviation"] = 3,
			["world_combat_is_trash"] = false,
			["update_speed"] = 0.3300000131130219,
			["bookmark_text_size"] = 11,
			["animation_speed_mintravel"] = 0.45,
			["track_item_level"] = true,
			["windows_fade_in"] = {
				"in", -- [1]
				0.2, -- [2]
			},
			["instances_menu_click_to_open"] = false,
			["overall_clear_newchallenge"] = true,
			["current_dps_meter"] = {
				["enabled"] = false,
				["font_color"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
					1, -- [4]
				},
				["arena_enabled"] = true,
				["font_shadow"] = "NONE",
				["font_size"] = 18,
				["mythic_dungeon_enabled"] = true,
				["sample_size"] = 5,
				["font_face"] = "Friz Quadrata TT",
				["frame"] = {
					["show_title"] = false,
					["strata"] = "LOW",
					["backdrop_color"] = {
						0, -- [1]
						0, -- [2]
						0, -- [3]
						0.2, -- [4]
					},
					["locked"] = false,
					["height"] = 65,
					["width"] = 220,
				},
				["update_interval"] = 0.3,
				["options_frame"] = {
				},
			},
			["data_cleanup_logout"] = false,
			["instances_disable_bar_highlight"] = false,
			["trash_concatenate"] = false,
			["color_by_arena_team"] = true,
			["animation_speed"] = 33,
			["disable_stretch_from_toolbar"] = false,
			["disable_lock_ungroup_buttons"] = false,
			["memory_ram"] = 64,
			["disable_window_groups"] = false,
			["instances_suppress_trash"] = 0,
			["options_window"] = {
				["scale"] = 1,
			},
			["animation_speed_maxtravel"] = 3,
			["instances_segments_locked"] = true,
			["deadlog_limit"] = 16,
			["font_faces"] = {
				["menus"] = "Friz Quadrata TT",
			},
			["instances_no_libwindow"] = false,
			["clear_ungrouped"] = true,
			["data_broker_text"] = "",
			["segments_amount"] = 40,
			["report_lines"] = 5,
			["instances"] = {
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -77.00015258789062,
							["x"] = 579.9332885742188,
							["w"] = 204.4000396728516,
							["h"] = 96.66668701171875,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						17, -- [1]
						-1, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["skin_custom"] = "",
					["fontstrings_width"] = 35,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 13,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-17, -- [1]
							1, -- [2]
						},
						["show_timer"] = true,
						["enable_custom_text"] = false,
						["text_color"] = {
							0.976470588235294, -- [1]
							1, -- [2]
							0.988235294117647, -- [3]
							1, -- [4]
						},
					},
					["ignore_mass_showhide"] = false,
					["switch_all_roles_after_wipe"] = false,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["micro_displays_side"] = 2,
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0509803921568627,
					["menu_icons_alpha"] = 0.5,
					["bg_b"] = 0.454901960784314,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.5333333333333333, -- [1]
						0.6078431372549019, -- [2]
						0.596078431372549, -- [3]
						0.6572928428649902, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Serenity",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 70,
					["__snapV"] = false,
					["__snapH"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textYMod"] = 1,
								["timeType"] = 1,
								["textAlign"] = 3,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textYMod"] = 1,
								["timeType"] = 1,
								["textAlign"] = 1,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textYMod"] = 1,
								["timeType"] = 1,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["grab_on_top"] = false,
					["__was_opened"] = true,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.0216164588928223,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["fontstrings_text3_anchor"] = 35,
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["stretch_button_side"] = 1,
					["hide_in_combat_alpha"] = 0,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = true,
						["fixed_text_color"] = {
							0.9568627450980391, -- [1]
							0.9803921568627451, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 0,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\ARIALN.TTF",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 1,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["font_size"] = 12,
						["textL_translit_text"] = false,
						["height"] = 11,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\bar_background",
						["use_spec_icons"] = true,
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.501719892024994,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1} - {data3}{data2}",
						["textR_bracket"] = "[",
						["textR_enable_custom_text"] = false,
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textL_show_number"] = true,
						["texture_custom"] = "",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "DGround",
						["start_after_icon"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4",
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["texture_background"] = "Details D'ictum",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0.0862745098039216, -- [2]
							0.180392156862745, -- [3]
							0.350894033908844, -- [4]
						},
						["font_face"] = "Arial Narrow",
						["texture_class_colors"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["fast_ps_update"] = true,
						["textR_separator"] = ",",
						["texture_custom_file"] = "Interface\\",
					},
					["show_statusbar"] = false,
					["libwindow"] = {
						["y"] = -77.00016784667969,
						["x"] = -0.5333251953125,
						["point"] = "RIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.6572928428649902,
						["overlay"] = {
							0.5333333333333333, -- [1]
							0.6078431372549019, -- [2]
							0.596078431372549, -- [3]
						},
					},
					["backdrop_texture"] = "Details Ground",
					["bars_grow_direction"] = 1,
					["switch_damager"] = false,
					["switch_tank_in_combat"] = false,
					["bars_inverted"] = false,
					["switch_damager_in_combat"] = false,
					["icon_desaturated"] = false,
					["bars_sort_direction"] = 1,
					["auto_current"] = true,
					["menu_anchor_down"] = {
						15, -- [1]
						-3, -- [2]
					},
					["clickthrough_rows"] = false,
					["version"] = 3,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -77.00015258789062,
							["x"] = 579.9332885742188,
							["w"] = 204.4000396728516,
							["h"] = 96.66668701171875,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["switch_tank"] = false,
					["plugins_grow_direction"] = 1,
					["wallpaper"] = {
						["enabled"] = false,
						["width"] = 266.000061035156,
						["texcoord"] = {
							0.0480000019073486, -- [1]
							0.298000011444092, -- [2]
							0.630999984741211, -- [3]
							0.755999984741211, -- [4]
						},
						["overlay"] = {
							0.999997794628143, -- [1]
							0.999997794628143, -- [2]
							0.999997794628143, -- [3]
							0.266666084527969, -- [4]
						},
						["anchor"] = "all",
						["height"] = 225.999984741211,
						["alpha"] = 0.266666680574417,
						["texture"] = "Interface\\AddOns\\Details\\images\\skins\\elvui",
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["show_sidebars"] = false,
					["micro_displays_locked"] = true,
					["use_multi_fontstrings"] = false,
					["menu_icons_size"] = 0.7999999523162842,
				}, -- [1]
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -336.9999923706055,
							["x"] = 426.7332153320313,
							["w"] = 157.4668273925781,
							["h"] = 94.00001525878906,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						17, -- [1]
						-1, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["fontstrings_width"] = 35,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["textR_outline_small"] = true,
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = true,
						["fixed_text_color"] = {
							0.956862745098039, -- [1]
							0.980392156862745, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\2002.TTF",
						["backdrop"] = {
							["enabled"] = false,
							["size"] = 1,
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["texture"] = "Details BarBorder 2",
						},
						["font_size"] = 16,
						["textL_translit_text"] = false,
						["height"] = 16.94814300537109,
						["texture_file"] = "Interface\\AddOns\\Details\\images\\bar_background",
						["use_spec_icons"] = true,
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.501719892024994,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1} - {data3}{data2}",
						["textR_bracket"] = "[",
						["textR_enable_custom_text"] = false,
						["percent_type"] = 1,
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textL_show_number"] = true,
						["texture_custom"] = "",
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "DGround",
						["start_after_icon"] = true,
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4",
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["texture_background"] = "Details D'ictum",
						["textR_class_colors"] = false,
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["fixed_texture_background_color"] = {
							0, -- [1]
							0.0862745098039216, -- [2]
							0.180392156862745, -- [3]
							0.350894033908844, -- [4]
						},
						["font_face"] = "2002",
						["texture_class_colors"] = true,
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["fast_ps_update"] = false,
						["textR_separator"] = ",",
						["texture_custom_file"] = "Interface\\",
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0509803921568627,
					["menu_icons_alpha"] = 0.5,
					["bg_b"] = 0.454901960784314,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.5333333333333333, -- [1]
						0.6078431372549019, -- [2]
						0.596078431372549, -- [3]
						0.6572928428649902, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Serenity",
					["following"] = {
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["enabled"] = false,
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 70,
					["__snapV"] = false,
					["__snapH"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["isHidden"] = false,
								["timeType"] = 1,
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["maxSectionIds"] = 18,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PATTRIBUTE"] = {
								["isHidden"] = false,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									0.7, -- [4]
								},
								["textAlign"] = 1,
								["timeType"] = 1,
								["textSize"] = 10,
								["textYMod"] = 0,
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["isHidden"] = false,
								["timeType"] = 1,
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["maxSectionIds"] = 18,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PATTRIBUTE",
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["__was_opened"] = false,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.0216164588928223,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onenter"] = 1,
						["iconstoo"] = true,
						["ignorebars"] = false,
						["onleave"] = 1,
					},
					["switch_all_roles_after_wipe"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["backdrop_texture"] = "Details Ground",
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["show_sidebars"] = false,
					["hide_in_combat_alpha"] = 0,
					["bars_inverted"] = false,
					["show_statusbar"] = false,
					["libwindow"] = {
						["y"] = 0,
						["x"] = -177.199951171875,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.6572928428649902,
						["overlay"] = {
							0.5333333333333333, -- [1]
							0.6078431372549019, -- [2]
							0.596078431372549, -- [3]
						},
					},
					["menu_icons_size"] = 0.8,
					["menu_anchor_down"] = {
						15, -- [1]
						-3, -- [2]
					},
					["switch_tank_in_combat"] = false,
					["switch_damager_in_combat"] = false,
					["skin_custom"] = "",
					["grab_on_top"] = false,
					["attribute_text"] = {
						["enabled"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 13,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-17, -- [1]
							1, -- [2]
						},
						["show_timer"] = true,
						["enable_custom_text"] = false,
						["text_color"] = {
							0.976470588235294, -- [1]
							1, -- [2]
							0.988235294117647, -- [3]
							1, -- [4]
						},
					},
					["bars_grow_direction"] = 1,
					["auto_current"] = true,
					["switch_damager"] = false,
					["version"] = 3,
					["clickthrough_rows"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -336.9999923706055,
							["x"] = 426.7332153320313,
							["w"] = 157.4668273925781,
							["h"] = 94.00001525878906,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["fontstrings_text3_anchor"] = 35,
					["switch_tank"] = false,
					["wallpaper"] = {
						["enabled"] = false,
						["width"] = 266.000061035156,
						["texcoord"] = {
							0.0480000019073486, -- [1]
							0.298000011444092, -- [2]
							0.630999984741211, -- [3]
							0.755999984741211, -- [4]
						},
						["overlay"] = {
							0.999997794628143, -- [1]
							0.999997794628143, -- [2]
							0.999997794628143, -- [3]
							0.266666084527969, -- [4]
						},
						["anchor"] = "all",
						["height"] = 225.999984741211,
						["alpha"] = 0.266666680574417,
						["texture"] = "Interface\\AddOns\\Details\\images\\skins\\elvui",
					},
					["stretch_button_side"] = 1,
					["icon_desaturated"] = false,
					["micro_displays_side"] = 2,
					["use_multi_fontstrings"] = false,
					["bars_sort_direction"] = 1,
				}, -- [2]
				{
					["__pos"] = {
						["normal"] = {
							["y"] = -304.9999923706055,
							["x"] = 265.066650390625,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["hide_in_combat_type"] = 1,
					["clickthrough_window"] = false,
					["menu_anchor"] = {
						17, -- [1]
						-1, -- [2]
						["side"] = 2,
					},
					["bg_r"] = 0,
					["hide_out_of_combat"] = false,
					["color_buttons"] = {
						1, -- [1]
						1, -- [2]
						1, -- [3]
						1, -- [4]
					},
					["toolbar_icon_file"] = "Interface\\AddOns\\Details\\images\\toolbar_icons",
					["micro_displays_locked"] = true,
					["fontstrings_width"] = 35,
					["tooltip"] = {
						["n_abilities"] = 3,
						["n_enemies"] = 3,
					},
					["switch_all_roles_in_combat"] = false,
					["clickthrough_toolbaricons"] = false,
					["row_info"] = {
						["textR_outline"] = false,
						["spec_file"] = "Interface\\AddOns\\Details\\images\\spec_icons_normal",
						["textL_outline"] = false,
						["texture_highlight"] = "Interface\\FriendsFrame\\UI-FriendsList-Highlight",
						["textL_outline_small"] = true,
						["textL_enable_custom_text"] = true,
						["fixed_text_color"] = {
							0.956862745098039, -- [1]
							0.980392156862745, -- [2]
							1, -- [3]
							1, -- [4]
						},
						["space"] = {
							["right"] = 0,
							["left"] = 0,
							["between"] = 1,
						},
						["texture_background_class_color"] = false,
						["textL_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["font_face_file"] = "Fonts\\2002.TTF",
						["backdrop"] = {
							["enabled"] = false,
							["texture"] = "Details BarBorder 2",
							["color"] = {
								1, -- [1]
								1, -- [2]
								1, -- [3]
								1, -- [4]
							},
							["size"] = 1,
						},
						["models"] = {
							["upper_model"] = "Spells\\AcidBreath_SuperGreen.M2",
							["lower_model"] = "World\\EXPANSION02\\DOODADS\\Coldarra\\COLDARRALOCUS.m2",
							["upper_alpha"] = 0.501719892024994,
							["lower_enabled"] = false,
							["lower_alpha"] = 0.1,
							["upper_enabled"] = false,
						},
						["textL_translit_text"] = false,
						["texture_custom_file"] = "Interface\\",
						["texture_file"] = "Interface\\AddOns\\Details\\images\\bar_background",
						["use_spec_icons"] = true,
						["font_size"] = 16,
						["icon_file"] = "Interface\\AddOns\\Details\\images\\classes_small",
						["icon_grayscale"] = false,
						["textL_custom_text"] = "{data1} - {data3}{data2}",
						["textR_bracket"] = "[",
						["texture_custom"] = "",
						["textR_show_data"] = {
							true, -- [1]
							true, -- [2]
							true, -- [3]
						},
						["fixed_texture_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textL_show_number"] = true,
						["textR_enable_custom_text"] = false,
						["textR_outline_small"] = true,
						["textR_custom_text"] = "{data1} ({data2}, {data3}%)",
						["texture"] = "DGround",
						["fixed_texture_background_color"] = {
							0, -- [1]
							0.0862745098039216, -- [2]
							0.180392156862745, -- [3]
							0.350894033908844, -- [4]
						},
						["texture_background_file"] = "Interface\\AddOns\\Details\\images\\bar4",
						["texture_background"] = "Details D'ictum",
						["textR_outline_small_color"] = {
							0, -- [1]
							0, -- [2]
							0, -- [3]
							1, -- [4]
						},
						["textR_class_colors"] = false,
						["textL_class_colors"] = false,
						["alpha"] = 1,
						["no_icon"] = false,
						["icon_offset"] = {
							0, -- [1]
							0, -- [2]
						},
						["start_after_icon"] = true,
						["font_face"] = "2002",
						["texture_class_colors"] = true,
						["percent_type"] = 1,
						["fast_ps_update"] = false,
						["textR_separator"] = ",",
						["height"] = 16.94814300537109,
					},
					["ignore_mass_showhide"] = false,
					["plugins_grow_direction"] = 1,
					["menu_icons"] = {
						true, -- [1]
						true, -- [2]
						true, -- [3]
						true, -- [4]
						true, -- [5]
						false, -- [6]
						["space"] = -2,
						["shadow"] = false,
					},
					["desaturated_menu"] = false,
					["auto_hide_menu"] = {
						["left"] = false,
						["right"] = false,
					},
					["window_scale"] = 1,
					["hide_icon"] = true,
					["toolbar_side"] = 1,
					["bg_g"] = 0.0509803921568627,
					["menu_icons_alpha"] = 0.5,
					["bg_b"] = 0.454901960784314,
					["switch_healer_in_combat"] = false,
					["color"] = {
						0.5333333333333333, -- [1]
						0.6078431372549019, -- [2]
						0.596078431372549, -- [3]
						0.6572928428649902, -- [4]
					},
					["hide_on_context"] = {
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [1]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [2]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [3]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [4]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [5]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [6]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [7]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [8]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [9]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [10]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [11]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [12]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [13]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [14]
						{
							["enabled"] = false,
							["inverse"] = false,
							["value"] = 100,
						}, -- [15]
					},
					["skin"] = "Serenity",
					["following"] = {
						["enabled"] = false,
						["bar_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
						["text_color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["switch_healer"] = false,
					["fontstrings_text2_anchor"] = 70,
					["__snapV"] = false,
					["__snapH"] = false,
					["StatusBarSaved"] = {
						["center"] = "DETAILS_STATUSBAR_PLUGIN_CLOCK",
						["right"] = "DETAILS_STATUSBAR_PLUGIN_PDPS",
						["options"] = {
							["DETAILS_STATUSBAR_PLUGIN_PDPS"] = {
								["isHidden"] = false,
								["timeType"] = 1,
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["maxSectionIds"] = 18,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_PSEGMENT"] = {
								["isHidden"] = false,
								["timeType"] = 1,
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["maxSectionIds"] = 18,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
							["DETAILS_STATUSBAR_PLUGIN_CLOCK"] = {
								["isHidden"] = false,
								["timeType"] = 1,
								["textYMod"] = 1,
								["segmentType"] = 2,
								["textFace"] = "Accidental Presidency",
								["maxSectionIds"] = 18,
								["textAlign"] = 2,
								["textSize"] = 10,
								["textColor"] = {
									1, -- [1]
									1, -- [2]
									1, -- [3]
									1, -- [4]
								},
							},
						},
						["left"] = "DETAILS_STATUSBAR_PLUGIN_PSEGMENT",
					},
					["total_bar"] = {
						["enabled"] = false,
						["only_in_group"] = true,
						["icon"] = "Interface\\ICONS\\INV_Sigil_Thorim",
						["color"] = {
							1, -- [1]
							1, -- [2]
							1, -- [3]
						},
					},
					["__was_opened"] = false,
					["instance_button_anchor"] = {
						-27, -- [1]
						1, -- [2]
					},
					["bg_alpha"] = 0.0216164588928223,
					["fontstrings_text4_anchor"] = 0,
					["__locked"] = false,
					["menu_alpha"] = {
						["enabled"] = false,
						["onleave"] = 1,
						["ignorebars"] = false,
						["iconstoo"] = true,
						["onenter"] = 1,
					},
					["switch_all_roles_after_wipe"] = false,
					["row_show_animation"] = {
						["anim"] = "Fade",
						["options"] = {
						},
					},
					["backdrop_texture"] = "Details Ground",
					["strata"] = "LOW",
					["clickthrough_incombatonly"] = true,
					["__snap"] = {
					},
					["show_sidebars"] = false,
					["hide_in_combat_alpha"] = 0,
					["bars_inverted"] = false,
					["show_statusbar"] = false,
					["libwindow"] = {
						["y"] = 0,
						["x"] = -262.5999755859375,
						["point"] = "BOTTOMRIGHT",
						["scale"] = 1,
					},
					["statusbar_info"] = {
						["alpha"] = 0.6572928428649902,
						["overlay"] = {
							0.5333333333333333, -- [1]
							0.6078431372549019, -- [2]
							0.596078431372549, -- [3]
						},
					},
					["menu_icons_size"] = 0.8,
					["menu_anchor_down"] = {
						15, -- [1]
						-3, -- [2]
					},
					["switch_tank_in_combat"] = false,
					["switch_damager_in_combat"] = false,
					["skin_custom"] = "",
					["grab_on_top"] = false,
					["attribute_text"] = {
						["show_timer"] = true,
						["shadow"] = false,
						["side"] = 1,
						["text_size"] = 13,
						["custom_text"] = "{name}",
						["text_face"] = "Accidental Presidency",
						["anchor"] = {
							-17, -- [1]
							1, -- [2]
						},
						["text_color"] = {
							0.976470588235294, -- [1]
							1, -- [2]
							0.988235294117647, -- [3]
							1, -- [4]
						},
						["enable_custom_text"] = false,
						["enabled"] = true,
					},
					["bars_grow_direction"] = 1,
					["auto_current"] = true,
					["switch_damager"] = false,
					["version"] = 3,
					["clickthrough_rows"] = false,
					["hide_in_combat"] = false,
					["posicao"] = {
						["normal"] = {
							["y"] = -304.9999923706055,
							["x"] = 265.066650390625,
							["w"] = 310,
							["h"] = 158.0000152587891,
						},
						["solo"] = {
							["y"] = 2,
							["x"] = 1,
							["w"] = 300,
							["h"] = 200,
						},
					},
					["fontstrings_text3_anchor"] = 35,
					["switch_tank"] = false,
					["wallpaper"] = {
						["overlay"] = {
							0.999997794628143, -- [1]
							0.999997794628143, -- [2]
							0.999997794628143, -- [3]
							0.266666084527969, -- [4]
						},
						["texture"] = "Interface\\AddOns\\Details\\images\\skins\\elvui",
						["texcoord"] = {
							0.0480000019073486, -- [1]
							0.298000011444092, -- [2]
							0.630999984741211, -- [3]
							0.755999984741211, -- [4]
						},
						["enabled"] = false,
						["anchor"] = "all",
						["height"] = 225.999984741211,
						["alpha"] = 0.266666680574417,
						["width"] = 266.000061035156,
					},
					["stretch_button_side"] = 1,
					["icon_desaturated"] = false,
					["micro_displays_side"] = 2,
					["use_multi_fontstrings"] = false,
					["bars_sort_direction"] = 1,
				}, -- [3]
			},
			["use_battleground_server_parser"] = false,
			["skin"] = "Minimalistic",
			["override_spellids"] = true,
			["use_scroll"] = false,
			["report_schema"] = 1,
			["player_details_window"] = {
				["scale"] = 1,
				["skin"] = "ElvUI",
				["bar_texture"] = "Skyline",
			},
			["overall_clear_newboss"] = true,
			["overall_clear_logout"] = false,
			["window_clamp"] = {
				-8, -- [1]
				0, -- [2]
				21, -- [3]
				-14, -- [4]
			},
			["cloud_capture"] = true,
			["damage_taken_everything"] = false,
			["scroll_speed"] = 2,
			["new_window_size"] = {
				["height"] = 158,
				["width"] = 310,
			},
			["memory_threshold"] = 3,
			["deadlog_events"] = 32,
			["chat_tab_embed"] = {
				["enabled"] = false,
				["y_offset"] = 0,
				["x_offset"] = 0,
				["tab_name"] = "",
				["single_window"] = false,
			},
			["close_shields"] = false,
			["class_coords"] = {
				["HUNTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["WARRIOR"] = {
					0, -- [1]
					0.25, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["SHAMAN"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["MAGE"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["PET"] = {
					0.25, -- [1]
					0.49609375, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DRUID"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONK"] = {
					0.5, -- [1]
					0.73828125, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["DEATHKNIGHT"] = {
					0.25, -- [1]
					0.5, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["WARLOCK"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNKNOW"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PRIEST"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.25, -- [3]
					0.5, -- [4]
				},
				["UNGROUPPLAYER"] = {
					0.5, -- [1]
					0.75, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["Alliance"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["ENEMY"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["DEMONHUNTER"] = {
					0.73828126, -- [1]
					1, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["Horde"] = {
					0.7421875, -- [1]
					0.98828125, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
				["PALADIN"] = {
					0, -- [1]
					0.25, -- [2]
					0.5, -- [3]
					0.75, -- [4]
				},
				["ROGUE"] = {
					0.49609375, -- [1]
					0.7421875, -- [2]
					0, -- [3]
					0.25, -- [4]
				},
				["MONSTER"] = {
					0, -- [1]
					0.25, -- [2]
					0.75, -- [3]
					1, -- [4]
				},
			},
			["windows_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["disable_alldisplays_window"] = false,
			["time_type_original"] = 1,
			["default_bg_color"] = 0.0941,
			["trash_auto_remove"] = true,
			["hotcorner_topleft"] = {
				["hide"] = false,
			},
			["clear_graphic"] = true,
			["total_abbreviation"] = 2,
			["segments_auto_erase"] = 1,
			["options_group_edit"] = true,
			["segments_amount_to_save"] = 40,
			["minimap"] = {
				["onclick_what_todo"] = 1,
				["radius"] = 160,
				["hide"] = false,
				["minimapPos"] = 192.5234914509818,
				["text_format"] = 3,
				["text_type"] = 1,
			},
			["instances_amount"] = 5,
			["max_window_size"] = {
				["height"] = 450,
				["width"] = 480,
			},
			["animation_speed_triggertravel"] = 5,
			["only_pvp_frags"] = false,
			["disable_stretch_button"] = false,
			["deny_score_messages"] = false,
			["broadcaster_enabled"] = false,
			["class_colors"] = {
				["HUNTER"] = {
					0.67, -- [1]
					0.83, -- [2]
					0.45, -- [3]
				},
				["WARRIOR"] = {
					0.78, -- [1]
					0.61, -- [2]
					0.43, -- [3]
				},
				["PALADIN"] = {
					0.96, -- [1]
					0.55, -- [2]
					0.73, -- [3]
				},
				["MAGE"] = {
					0.41, -- [1]
					0.8, -- [2]
					0.94, -- [3]
				},
				["ARENA_YELLOW"] = {
					1, -- [1]
					1, -- [2]
					0.25, -- [3]
				},
				["UNGROUPPLAYER"] = {
					0.4, -- [1]
					0.4, -- [2]
					0.4, -- [3]
				},
				["DRUID"] = {
					1, -- [1]
					0.49, -- [2]
					0.04, -- [3]
				},
				["MONK"] = {
					0, -- [1]
					1, -- [2]
					0.59, -- [3]
				},
				["DEATHKNIGHT"] = {
					0.77, -- [1]
					0.12, -- [2]
					0.23, -- [3]
				},
				["ENEMY"] = {
					0.94117, -- [1]
					0, -- [2]
					0.0196, -- [3]
					1, -- [4]
				},
				["UNKNOW"] = {
					0.2, -- [1]
					0.2, -- [2]
					0.2, -- [3]
				},
				["PRIEST"] = {
					1, -- [1]
					1, -- [2]
					1, -- [3]
				},
				["SHAMAN"] = {
					0, -- [1]
					0.44, -- [2]
					0.87, -- [3]
				},
				["ROGUE"] = {
					1, -- [1]
					0.96, -- [2]
					0.41, -- [3]
				},
				["WARLOCK"] = {
					0.58, -- [1]
					0.51, -- [2]
					0.79, -- [3]
				},
				["DEMONHUNTER"] = {
					0.64, -- [1]
					0.19, -- [2]
					0.79, -- [3]
				},
				["version"] = 1,
				["NEUTRAL"] = {
					1, -- [1]
					1, -- [2]
					0, -- [3]
				},
				["PET"] = {
					0.3, -- [1]
					0.4, -- [2]
					0.5, -- [3]
				},
				["ARENA_GREEN"] = {
					0.4, -- [1]
					1, -- [2]
					0.4, -- [3]
				},
			},
			["segments_panic_mode"] = false,
			["numerical_system_symbols"] = "auto",
			["overall_flag"] = 16,
			["row_fade_out"] = {
				"out", -- [1]
				0.2, -- [2]
			},
			["font_sizes"] = {
				["menus"] = 10,
			},
			["minimum_combat_time"] = 5,
			["numerical_system"] = 1,
			["force_activity_time_pvp"] = true,
			["class_icons_small"] = "Interface\\AddOns\\Details\\images\\classes_small",
			["pvp_as_group"] = true,
			["disable_reset_button"] = false,
			["animate_scroll"] = false,
			["death_tooltip_width"] = 350,
			["time_type"] = 1,
			["default_bg_alpha"] = 0.5,
			["standard_skin"] = false,
		},
	},
	["report_pos"] = {
		1, -- [1]
		1, -- [2]
	},
	["latest_report_table"] = {
		{
			1, -- [1]
			1, -- [2]
			1, -- [3]
			5, -- [4]
			"PARTY", -- [5]
		}, -- [1]
	},
	["exp90temp"] = {
		["delete_damage_TCOB"] = true,
	},
	["always_use_profile"] = false,
	["immersion_special_units"] = true,
	["deathlog_healingdone_min_arena"] = 400,
	["boss_mods_timers"] = {
		["encounter_timers_bw"] = {
		},
		["encounter_timers_dbm"] = {
			["323685"] = {
				"323685", -- [1]
				"Timer323685cd", -- [2]
				"~Grasping Rift", -- [3]
				22.7, -- [4]
				2576095, -- [5]
				"cd", -- [6]
				323685, -- [7]
				3, -- [8]
				"2417", -- [9]
				["id"] = 2404,
			},
			["320069"] = {
				"320069", -- [1]
				"Timer320069cd", -- [2]
				"~Mortal Strike", -- [3]
				22.6, -- [4]
				132355, -- [5]
				"cd", -- [6]
				320069, -- [7]
				5, -- [8]
				"2397", -- [9]
				["id"] = 2391,
			},
			["339550"] = {
				"339550", -- [1]
				"Timer339550cd", -- [2]
				"~Echo of Battle", -- [3]
				7, -- [4]
				1778230, -- [5]
				"cd", -- [6]
				339550, -- [7]
				3, -- [8]
				"2417", -- [9]
				["id"] = 2404,
			},
			["320644"] = {
				"320644", -- [1]
				"Timer320644cdcount	1", -- [2]
				"~Brutal Combo (1)", -- [3]
				5.8, -- [4]
				1390946, -- [5]
				"cdcount", -- [6]
				320644, -- [7]
				5, -- [8]
				"2390", -- [9]
				["id"] = 2366,
			},
			["319589"] = {
				"319589", -- [1]
				"Timer319589cd", -- [2]
				"~Grasping Hands", -- [3]
				8.2, -- [4]
				2576086, -- [5]
				"cd", -- [6]
				319589, -- [7]
				3, -- [8]
				"2389", -- [9]
				["id"] = 2364,
			},
			["320063"] = {
				"320063", -- [1]
				"Timer320063cd", -- [2]
				"~Slam", -- [3]
				9.4, -- [4]
				132340, -- [5]
				"cd", -- [6]
				320063, -- [7]
				5, -- [8]
				"2397", -- [9]
				["id"] = 2391,
			},
			["323608"] = {
				"323608", -- [1]
				"Timer323608cd", -- [2]
				"~Dark Devastation", -- [3]
				15.7, -- [4]
				2576088, -- [5]
				"cd", -- [6]
				323608, -- [7]
				3, -- [8]
				"2417", -- [9]
				["id"] = 2404,
			},
			["319521"] = {
				"319521", -- [1]
				"Timer319521cd", -- [2]
				"~Draw Soul", -- [3]
				15.5, -- [4]
				2576083, -- [5]
				"cd", -- [6]
				319521, -- [7]
				3, -- [8]
				"2389", -- [9]
				["id"] = 2364,
			},
			["320272"] = {
				"320272", -- [1]
				"Timer320272cd", -- [2]
				"~Spectral Transference", -- [3]
				10.5, -- [4]
				2576086, -- [5]
				"cd", -- [6]
				320272, -- [7]
				5, -- [8]
				"2397", -- [9]
				["id"] = 2391,
			},
			["333231"] = {
				"333231", -- [1]
				"Timer333231cd", -- [2]
				"~Searing Death", -- [3]
				10.2, -- [4]
				2576089, -- [5]
				"cd", -- [6]
				333231, -- [7]
				3, -- [8]
				"2397", -- [9]
				["id"] = 2391,
			},
			["331618"] = {
				"331618", -- [1]
				"Timer331618cdcount	1", -- [2]
				"~Oppressive Banner (1)", -- [3]
				10.7, -- [4]
				3578234, -- [5]
				"cdcount", -- [6]
				331618, -- [7]
				1, -- [8]
				"2390", -- [9]
				["id"] = 2366,
			},
			["320180"] = {
				"320180", -- [1]
				"Timer320180cd", -- [2]
				"~Noxious Spores", -- [3]
				17.7, -- [4]
				464341, -- [5]
				"cd", -- [6]
				320180, -- [7]
				3, -- [8]
				"2397", -- [9]
				["id"] = 2391,
			},
			["318406"] = {
				"318406", -- [1]
				"Timer318406cd", -- [2]
				"~Tenderizing Smash", -- [3]
				14.5, -- [4]
				623773, -- [5]
				"cd", -- [6]
				318406, -- [7]
				3, -- [8]
				"2401", -- [9]
				["id"] = 2365,
			},
			["339706"] = {
				"339706", -- [1]
				"Timer339706cd", -- [2]
				"~Ghostly Charge", -- [3]
				17, -- [4]
				3511738, -- [5]
				"cd", -- [6]
				339706, -- [7]
				3, -- [8]
				"2417", -- [9]
				["id"] = 2404,
			},
			["324079"] = {
				"324079", -- [1]
				"Timer324079cd", -- [2]
				"~Reaping Scythe", -- [3]
				8.1, -- [4]
				1060569, -- [5]
				"cd", -- [6]
				324079, -- [7]
				5, -- [8]
				"2417", -- [9]
				["id"] = 2404,
			},
			["324449"] = {
				"324449", -- [1]
				"Timer324449cd", -- [2]
				"~Manifest Death", -- [3]
				23.9, -- [4]
				2576087, -- [5]
				"cd", -- [6]
				324449, -- [7]
				3, -- [8]
				"2417", -- [9]
				["id"] = 2404,
			},
			["320102"] = {
				"320102", -- [1]
				"Timer320102cdcount	1", -- [2]
				"~Blood and Glory (1)", -- [3]
				33.9, -- [4]
				1322720, -- [5]
				"cdcount", -- [6]
				320102, -- [7]
				3, -- [8]
				"2390", -- [9]
				["id"] = 2366,
			},
			["320050"] = {
				"320050", -- [1]
				"Timer320050cdcount	1", -- [2]
				"~Might of Maldraxxus (1)", -- [3]
				17.1, -- [4]
				1115905, -- [5]
				"cdcount", -- [6]
				320050, -- [7]
				6, -- [8]
				"2390", -- [9]
				["id"] = 2366,
			},
			["322795"] = {
				"322795", -- [1]
				"Timer322795next", -- [2]
				"Meat Hooks", -- [3]
				5.8, -- [4]
				1373906, -- [5]
				"next", -- [6]
				322795, -- [7]
				1, -- [8]
				"2401", -- [9]
				["id"] = 2365,
			},
			["323515"] = {
				"323515", -- [1]
				"Timer323515cd", -- [2]
				"~Hateful Strike", -- [3]
				3.7, -- [4]
				237517, -- [5]
				"cd", -- [6]
				323515, -- [7]
				5, -- [8]
				"2401", -- [9]
				["id"] = 2365,
			},
			["319626"] = {
				"319626", -- [1]
				"Timer319626cd", -- [2]
				"~Phantasmal Parasite", -- [3]
				3.3, -- [4]
				236298, -- [5]
				"cd", -- [6]
				319626, -- [7]
				3, -- [8]
				"2389", -- [9]
				["id"] = 2364,
			},
		},
	},
	["damage_scroll_auto_open"] = false,
	["spell_school_cache"] = {
		["Manifest Death"] = 32,
		["Jagged Gash"] = 1,
		["Ghostly Charge"] = 32,
		["Vile Gas"] = 40,
		["Grievous Wound"] = 1,
		["Seismic Leap"] = 1,
		["Corpo-a-Corpo"] = 1,
		["Savage Flurry"] = 1,
		["Dark Devastation"] = 32,
		["All-Consuming Spite"] = 32,
		["Soulless"] = 32,
		["Coagulating Ooze"] = 40,
		["Reaping Scythe"] = 1,
		["Searing Death"] = 32,
		["Echoes of Carnage"] = 32,
		["Finishing Blow"] = 1,
		["Oppressive Banner"] = 1,
		["Reclaimed Soul"] = 1,
		["Noxious Spores"] = 40,
		["Quick Strike"] = 1,
		["Brutal Strike"] = 1,
		["Phantasmal Parasite"] = 32,
		["Chill of the Beyond"] = 32,
	},
	["deathlog_healingdone_min"] = 1,
	["plater"] = {
		["realtime_dps_enabled"] = false,
		["realtime_dps_size"] = 12,
		["realtime_dps_player_shadow"] = true,
		["damage_taken_enabled"] = false,
		["realtime_dps_player_size"] = 12,
		["damage_taken_size"] = 12,
		["realtime_dps_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_shadow"] = true,
		["damage_taken_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["damage_taken_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_color"] = {
			1, -- [1]
			1, -- [2]
			0, -- [3]
			1, -- [4]
		},
		["realtime_dps_player_anchor"] = {
			["y"] = 0,
			["x"] = 0,
			["side"] = 7,
		},
		["realtime_dps_player_enabled"] = false,
		["realtime_dps_shadow"] = true,
	},
	["exit_log"] = {
		"1 - Closing Janela Info.", -- [1]
		"2 - Clearing user place from instances.", -- [2]
		"4 - Reversing switches.", -- [3]
		"6 - Saving Config.", -- [4]
		"7 - Saving Profiles.", -- [5]
		"8 - Saving nicktag cache.", -- [6]
	},
	["run_code"] = {
		["on_specchanged"] = "\n-- run when the player changes its spec",
		["on_zonechanged"] = "\n-- when the player changes zone, this code will run",
		["on_init"] = "\n-- code to run when Details! initializes, put here code which only will run once\n-- this also will run then the profile is changed\n\n--size of the death log tooltip in the Deaths display (default 350)\nDetails.death_tooltip_width = 350;\n\n--when in arena or battleground, details! silently switch to activity time (goes back to the old setting on leaving, default true)\nDetails.force_activity_time_pvp = true;\n\n--speed of the bar animations (default 33)\nDetails.animation_speed = 33;\n\n--threshold to trigger slow or fast speed (default 0.45)\nDetails.animation_speed_mintravel = 0.45;\n\n--call to update animations\nDetails:RefreshAnimationFunctions();\n\n--max window size, does require a /reload to work (default 480 x 450)\nDetails.max_window_size.width = 480;\nDetails.max_window_size.height = 450;\n\n--use the arena team color as the class color (default true)\nDetails.color_by_arena_team = true;\n\n--use the role icon in the player bar when inside an arena (default false)\nDetails.show_arena_role_icon = false;\n\n--how much time the update warning is shown (default 10)\nDetails.update_warning_timeout = 10;",
		["on_groupchange"] = "\n-- this code runs when the player enter or leave a group",
		["on_leavecombat"] = "\n-- this code runs when the player leave combat",
		["on_entercombat"] = "\n-- this code runs when the player enters in combat",
	},
	["tutorial"] = {
		["unlock_button"] = 2,
		["main_help_button"] = 679,
		["logons"] = 679,
		["ctrl_click_close_tutorial"] = false,
		["DISABLE_ONDEATH_PANEL"] = true,
		["STREAMER_PLUGIN_FIRSTRUN"] = true,
		["FULL_DELETE_WINDOW"] = true,
		["FORGE_TUTORIAL"] = true,
		["DETAILS_INFO_TUTORIAL1"] = true,
		["alert_frames"] = {
			false, -- [1]
			false, -- [2]
			false, -- [3]
			false, -- [4]
			false, -- [5]
			false, -- [6]
		},
		["bookmark_tutorial"] = false,
		["OVERALLDATA_WARNING1"] = 7,
		["WINDOW_GROUP_MAKING1"] = true,
		["version_announce"] = 0,
		["HISTORYPANEL_TUTORIAL"] = true,
		["DETAILS_INFO_TUTORIAL2"] = 10,
		["MIN_COMBAT_TIME"] = true,
		["WINDOW_LOCK_UNLOCK1"] = true,
	},
	["custom"] = {
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show who in your raid used a potion during the encounter.",
			["tooltip"] = "			--init:\n			local player, combat, instance = ...\n			\n			--get the debuff container for potion of focus\n			local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n			if (debuff_uptime_container) then\n				local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n				if (focus_potion) then\n				local name, _, icon = GetSpellInfo (DETAILS_FOCUS_POTION_ID)\n				GameCooltip:AddLine (name, 1) --> can use only 1 focus potion (can't be pre-potion)\n				_detalhes:AddTooltipBackgroundStatusbar()\n				GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n			end\n			\n			--get the misc actor container\n			local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n			if (buff_uptime_container) then\n				for spellId, _ in pairs (DetailsFramework.PotionIDs) do\n					local potionUsed = buff_uptime_container [spellId]\n			\n					if (potionUsed) then\n						local name, _, icon = GetSpellInfo (spellId)\n						GameCooltip:AddLine (name, potionUsed.activedamt)\n						_detalhes:AddTooltipBackgroundStatusbar()\n						GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n					end\n				end\n			end\n			",
			["attribute"] = false,
			["name"] = "Potion Used",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n				\n				--get the misc actor container\n				local misc_container = combat:GetActorList ( DETAILS_ATTRIBUTE_MISC )\n				\n				--do the loop:\n				for _, player in ipairs ( misc_container ) do \n					\n					--only player in group\n					if (player:IsGroupPlayer()) then\n						\n						local found_potion = false\n						\n						--get the spell debuff uptime container\n						local debuff_uptime_container = player.debuff_uptime and player.debuff_uptime_spells and player.debuff_uptime_spells._ActorTable\n						if (debuff_uptime_container) then\n							--potion of focus (can't use as pre-potion, so, its amount is always 1\n							local focus_potion = debuff_uptime_container [DETAILS_FOCUS_POTION_ID]\n							\n							if (focus_potion) then\n								total = total + 1\n								found_potion = true\n								if (top < 1) then\n									top = 1\n								end\n								--add amount to the player \n								instance_container:AddValue (player, 1)\n							end\n						end\n						\n						--get the spell buff uptime container\n						local buff_uptime_container = player.buff_uptime and player.buff_uptime_spells and player.buff_uptime_spells._ActorTable\n						if (buff_uptime_container) then\n							for spellId, _ in pairs (DetailsFramework.PotionIDs) do\n								local potionUsed = buff_uptime_container [spellId]\n				\n								if (potionUsed) then\n									local used = potionUsed.activedamt\n									if (used and used > 0) then\n										total = total + used\n										found_potion = true\n										if (used > top) then\n											top = used\n										end\n				\n										--add amount to the player \n										instance_container:AddValue (player, used)\n									end\n								end\n							end\n						end\n						\n						if (found_potion) then\n							amount = amount + 1\n						end    \n					end\n				end\n				\n				--return:\n				return total, top, amount\n				",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Potion_03",
			["script_version"] = 6,
		}, -- [1]
		{
			["source"] = false,
			["desc"] = "Show who in your raid group used the healthstone or a heal potion.",
			["author"] = "Details! Team",
			["percent_script"] = false,
			["total_script"] = false,
			["attribute"] = false,
			["tooltip"] = "			--get the parameters passed\n			local actor, combat, instance = ...\n			\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GameCooltip = GameCooltip\n			local R, G, B, A = 0, 0, 0, 0.75\n			\n			local hs = actor:GetSpell (6262)\n			if (hs) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(6262)),  _detalhes:ToK(hs.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (6262)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_HEALTH_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_HEALTH_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_HEALTH_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n			\n			local pot = actor:GetSpell (DETAILS_REJU_POTION_ID)\n			if (pot) then\n				GameCooltip:AddLine (select (1, GetSpellInfo(DETAILS_REJU_POTION_ID)),  _detalhes:ToK(pot.total))\n				GameCooltip:AddIcon (select (3, GetSpellInfo (DETAILS_REJU_POTION_ID)), 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				GameCooltip:AddStatusBar (100, 1, R, G, B, A)\n			end\n\n			--Cooltip code\n			",
			["name"] = "Health Potion & Stone",
			["script"] = "			--get the parameters passed\n			local combat, instance_container, instance = ...\n			--declade the values to return\n			local total, top, amount = 0, 0, 0\n			\n			--do the loop\n			local AllHealCharacters = combat:GetActorList (DETAILS_ATTRIBUTE_HEAL)\n			for index, character in ipairs (AllHealCharacters) do\n				local AllSpells = character:GetSpellList()\n				local found = false\n				for spellid, spell in pairs (AllSpells) do\n					if (DETAILS_HEALTH_POTION_LIST [spellid]) then\n						instance_container:AddValue (character, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						found = true\n					end\n				end\n			\n				if (found) then\n					amount = amount + 1\n				end\n			end\n			--loop end\n			--return the values\n			return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\INV_Stone_04",
			["script_version"] = 15,
		}, -- [2]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "Tells how much time each character spent doing damage.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "Damage Activity Time",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, amount = 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Red",
			["script_version"] = 3,
		}, -- [3]
		{
			["source"] = false,
			["tooltip"] = "				\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				return string.format (\"%.1f\", value/top*100)\n			",
			["desc"] = "Tells how much time each character spent doing healing.",
			["attribute"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				local minutos, segundos = math.floor (value/60), math.floor (value%60)\n				return minutos .. \"m \" .. segundos .. \"s\"\n			",
			["name"] = "Healing Activity Time",
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				--get the misc actor container\n				local damage_container = combat:GetActorList ( DETAILS_ATTRIBUTE_HEAL )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container ) do \n					if (player.grupo) then\n						local activity = player:Tempo()\n						total = total + activity\n						amount = amount + 1\n						--add amount to the player \n						instance_container:AddValue (player, activity)\n					end\n				end\n				\n				--return:\n				return total, combat:GetCombatTime(), amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\UI-MicroStream-Green",
			["script_version"] = 2,
		}, -- [4]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the crowd control amount for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n					if (character.cc_done and character:IsPlayer()) then\n						local cc_done = floor (character.cc_done)\n						instance_container:AddValue (character, cc_done)\n						total = total + cc_done\n						if (cc_done > top) then\n							top = cc_done\n						end\n						amount = amount + 1\n					end\n				end\n\n				return total, top, amount\n			",
			["name"] = "Crowd Control Done",
			["tooltip"] = "				local actor, combat, instance = ...\n				local spells = {}\n				for spellid, spell in pairs (actor.cc_done_spells._ActorTable) do\n				    tinsert (spells, {spellid, spell.counter})\n				end\n\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				end\n\n				local targets = {}\n				for playername, amount in pairs (actor.cc_done_targets) do\n				    tinsert (targets, {playername, amount})\n				end\n\n				table.sort (targets, _detalhes.Sort2)\n\n				_detalhes:AddTooltipSpellHeaderText (\"Targets\", \"yellow\", #targets)\n				local class, _, _, _, _, r, g, b = _detalhes:GetClass (actor.nome)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, target in ipairs (targets) do\n				    GameCooltip:AddLine (target[1], target [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (target [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end\n				    --\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_FreezingBreath",
			["script_version"] = 11,
		}, -- [5]
		{
			["source"] = false,
			["author"] = "Details!",
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return floor (value)\n			",
			["desc"] = "Show the amount of crowd control received for each player.",
			["attribute"] = false,
			["script"] = "				local combat, instance_container, instance = ...\n				local total, top, amt = 0, 0, 0\n\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n				DETAILS_CUSTOM_CC_RECEIVED_CACHE = DETAILS_CUSTOM_CC_RECEIVED_CACHE or {}\n				wipe (DETAILS_CUSTOM_CC_RECEIVED_CACHE)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					\n					for player_name, amount in pairs (character.cc_done_targets) do\n					    local target = combat (1, player_name) or combat (2, player_name)\n					    if (target and target:IsPlayer()) then\n						instance_container:AddValue (target, amount)\n						total = total + amount\n						if (amount > top) then\n						    top = amount\n						end\n						if (not DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name]) then\n						    DETAILS_CUSTOM_CC_RECEIVED_CACHE [player_name] = true\n						    amt = amt + 1\n						end\n					    end\n					end\n					\n				    end\n				end\n\n				return total, top, amt\n			",
			["name"] = "Crowd Control Received",
			["tooltip"] = "				local actor, combat, instance = ...\n				local name = actor:name()\n				local spells, from = {}, {}\n				local misc_actors = combat:GetActorList (DETAILS_ATTRIBUTE_MISC)\n\n				for index, character in ipairs (misc_actors) do\n				    if (character.cc_done and character:IsPlayer()) then\n					local on_actor = character.cc_done_targets [name]\n					if (on_actor) then\n					    tinsert (from, {character:name(), on_actor})\n					    \n					    for spellid, spell in pairs (character.cc_done_spells._ActorTable) do\n						\n						local spell_on_actor = spell.targets [name]\n						if (spell_on_actor) then\n						    local has_spell\n						    for index, spell_table in ipairs (spells) do\n							if (spell_table [1] == spellid) then\n							    spell_table [2] = spell_table [2] + spell_on_actor\n							    has_spell = true\n							end\n						    end\n						    if (not has_spell) then\n							tinsert (spells, {spellid, spell_on_actor}) \n						    end\n						end\n						\n					    end            \n					end\n				    end\n				end\n\n				table.sort (from, _detalhes.Sort2)\n				table.sort (spells, _detalhes.Sort2)\n\n				for index, spell in ipairs (spells) do\n				    local name, _, icon = GetSpellInfo (spell [1])\n				    GameCooltip:AddLine (name, spell [2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    GameCooltip:AddIcon (icon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)    \n				end\n\n				_detalhes:AddTooltipSpellHeaderText (\"From\", \"yellow\", #from)\n				_detalhes:AddTooltipHeaderStatusbar (1, 1, 1, 0.6)\n\n				for index, t in ipairs (from) do\n				    GameCooltip:AddLine (t[1], t[2])\n				    _detalhes:AddTooltipBackgroundStatusbar()\n				    \n				    local class, _, _, _, _, r, g, b = _detalhes:GetClass (t [1])\n				    if (class and class ~= \"UNKNOW\") then\n					local texture, l, r, t, b = _detalhes:GetClassIcon (class)\n					GameCooltip:AddIcon (\"Interface\\\\AddOns\\\\Details\\\\images\\\\classes_small_alpha\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, l, r, t, b)\n				    else\n					GameCooltip:AddIcon (\"Interface\\\\GossipFrame\\\\IncompleteQuestIcon\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    end     \n				    \n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Frost_ChainsOfIce",
			["script_version"] = 3,
		}, -- [6]
		{
			["source"] = false,
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n				local dps = _detalhes:ToK (floor (value) / combat:GetCombatTime())\n				local percent = string.format (\"%.1f\", value/total*100)\n				return dps .. \", \" .. percent\n			",
			["desc"] = "Show your spells in the window.",
			["tooltip"] = "			--config:\n			--Background RBG and Alpha:\n			local R, G, B, A = 0, 0, 0, 0.75\n			local R, G, B, A = 0.1960, 0.1960, 0.1960, 0.8697\n\n			--get the parameters passed\n			local spell, combat, instance = ...\n\n			--get the cooltip object (we dont use the convencional GameTooltip here)\n			local GC = GameCooltip\n			GC:SetOption (\"YSpacingMod\", 0)\n\n			local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n\n			if (spell.n_dmg) then\n			    \n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n			    \n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n			    \n			    local debuff_uptime_total, cast_string = \"\", \"\"\n			    local misc_actor = instance.showing (4, _detalhes.playername)\n			    if (misc_actor) then\n				local debuff_uptime = misc_actor.debuff_uptime_spells and misc_actor.debuff_uptime_spells._ActorTable [spell.id] and misc_actor.debuff_uptime_spells._ActorTable [spell.id].uptime\n				if (debuff_uptime) then\n				    debuff_uptime_total = floor (debuff_uptime / instance.showing:GetCombatTime() * 100)\n				end\n				\n				local spell_cast = misc_actor.spell_cast and misc_actor.spell_cast [spell.id]\n				\n				if (not spell_cast and misc_actor.spell_cast) then\n				    local spellname = GetSpellInfo (spell.id)\n				    for casted_spellid, amount in pairs (misc_actor.spell_cast) do\n					local casted_spellname = GetSpellInfo (casted_spellid)\n					if (casted_spellname == spellname) then\n					    spell_cast = amount .. \" (|cFFFFFF00?|r)\"\n					end\n				    end\n				end\n				if (not spell_cast) then\n				    spell_cast = \"(|cFFFFFF00?|r)\"\n				end\n				cast_string = cast_string .. spell_cast\n			    end\n			    \n			    --Cooltip code\n			    GC:AddLine (\"Casts:\", cast_string or \"?\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (debuff_uptime_total ~= \"\") then\n				GC:AddLine (\"Uptime:\", (debuff_uptime_total or \"?\") .. \"%\")\n				GC:AddStatusBar (100, 1, R, G, B, A)\n			    end\n			    \n			    GC:AddLine (\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local average = spell.total / total_hits\n			    GC:AddLine (\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"E-Dps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local n_average = spell.n_dmg / spell.n_amt\n			    local T = (combat_time*spell.n_dmg)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n			    \n			    GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_dmg / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_dmg/spell.c_amt\n				local T = (combat_time*spell.c_dmg)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_dmg / T\n				\n				GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine (\"Average / E-Dps: \",  \"0 / 0\")    \n			    end\n			    \n			    GC:AddStatusBar (100, 1, R, G, B, A)\n\n			    \n			elseif (spell.n_curado) then\n			    \n			    local spellschool, schooltext = spell.spellschool, \"\"\n			    if (spellschool) then\n				local t = _detalhes.spells_school [spellschool]\n				if (t and t.name) then\n				    schooltext = t.formated\n				end\n			    end\n			    \n			    local total_hits = spell.counter\n			    local combat_time = instance.showing:GetCombatTime()\n			    \n			    --Cooltip code\n			    GC:AddLine (\"Hits:\", spell.counter)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local average = spell.total / total_hits\n			    GC:AddLine (\"Average:\", _detalhes:ToK (average))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"E-Hps:\", _detalhes:ToK (spell.total / combat_time))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    GC:AddLine (\"School:\", schooltext)\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Normal Hits: \", spell.n_amt .. \" (\" ..floor ( spell.n_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    local n_average = spell.n_curado / spell.n_amt\n			    local T = (combat_time*spell.n_curado)/spell.total\n			    local P = average/n_average*100\n			    T = P*T/100\n			    \n			    GC:AddLine (\"Average / E-Dps: \",  _detalhes:ToK (n_average) .. \" / \" .. format (\"%.1f\",spell.n_curado / T ))\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    --GC:AddLine (\" \")\n			    \n			    GC:AddLine (\"Critical Hits: \", spell.c_amt .. \" (\" ..floor ( spell.c_amt/total_hits*100) .. \"%)\")\n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			    \n			    if (spell.c_amt > 0) then\n				local c_average = spell.c_curado/spell.c_amt\n				local T = (combat_time*spell.c_curado)/spell.total\n				local P = average/c_average*100\n				T = P*T/100\n				local crit_dps = spell.c_curado / T\n				\n				GC:AddLine (\"Average / E-Hps: \",  _detalhes:ToK (c_average) .. \" / \" .. _detalhes:comma_value (crit_dps))\n			    else\n				GC:AddLine (\"Average / E-Hps: \",  \"0 / 0\")    \n			    end\n			    \n			    GC:AddStatusBar (100, 1, R, G, B, A)\n			end\n			",
			["attribute"] = false,
			["name"] = "My Spells",
			["script"] = "				--get the parameters passed\n				local combat, instance_container, instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				local player\n				local pet_attribute\n				\n				local role = DetailsFramework.UnitGroupRolesAssigned (\"player\")\n				local spec = DetailsFramework.GetSpecialization()\n				role = spec and DetailsFramework.GetSpecializationRole (spec) or role\n\n				if (role == \"DAMAGER\") then\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				elseif (role == \"HEALER\") then    \n					player = combat (DETAILS_ATTRIBUTE_HEAL, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_HEAL\n				else\n					player = combat (DETAILS_ATTRIBUTE_DAMAGE, _detalhes.playername)\n					pet_attribute = DETAILS_ATTRIBUTE_DAMAGE\n				end\n\n				--do the loop\n\n				if (player) then\n					local spells = player:GetSpellList()\n					for spellid, spell in pairs (spells) do\n						instance_container:AddValue (spell, spell.total)\n						total = total + spell.total\n						if (top < spell.total) then\n							top = spell.total\n						end\n						amount = amount + 1\n					end\n				    \n					for _, PetName in ipairs (player.pets) do\n						local pet = combat (pet_attribute, PetName)\n						if (pet) then\n							for spellid, spell in pairs (pet:GetSpellList()) do\n								instance_container:AddValue (spell, spell.total, nil, \" (\" .. PetName:gsub ((\" <.*\"), \"\") .. \")\")\n								total = total + spell.total\n								if (top < spell.total) then\n									top = spell.total\n								end\n								amount = amount + 1\n							end\n						end\n					end\n				end\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\CHATFRAME\\UI-ChatIcon-Battlenet",
			["script_version"] = 8,
		}, -- [7]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the amount of damage applied on targets marked with skull.",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [128]\n				if (DamageOnStar) then\n				    --RAID_TARGET_8 is the built-in localized word for 'Skull'.\n				    GameCooltip:AddLine (RAID_TARGET_8 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_8\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "Damage On Skull Marked Targets",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n				\n				--raid target flags: \n				-- 128: skull \n				-- 64: cross\n				-- 32: square\n				-- 16: moon\n				-- 8: triangle\n				-- 4: diamond\n				-- 2: circle\n				-- 1: star\n				\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					if (actor.raid_targets [128]) then\n					    CustomContainer:AddValue (actor, actor.raid_targets [128])\n					end        \n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_8",
			["script_version"] = 3,
		}, -- [8]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Show the amount of damage applied on targets marked with any other mark.",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object\n				local GameCooltip = GameCooltip\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--Cooltip code\n				local RaidTargets = actor.raid_targets\n\n				local DamageOnStar = RaidTargets [1]\n				if (DamageOnStar) then\n				    GameCooltip:AddLine (RAID_TARGET_1 .. \":\", format_func (_, DamageOnStar))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_1\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCircle = RaidTargets [2]\n				if (DamageOnCircle) then\n				    GameCooltip:AddLine (RAID_TARGET_2 .. \":\", format_func (_, DamageOnCircle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_2\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnDiamond = RaidTargets [4]\n				if (DamageOnDiamond) then\n				    GameCooltip:AddLine (RAID_TARGET_3 .. \":\", format_func (_, DamageOnDiamond))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_3\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnTriangle = RaidTargets [8]\n				if (DamageOnTriangle) then\n				    GameCooltip:AddLine (RAID_TARGET_4 .. \":\", format_func (_, DamageOnTriangle))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_4\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnMoon = RaidTargets [16]\n				if (DamageOnMoon) then\n				    GameCooltip:AddLine (RAID_TARGET_5 .. \":\", format_func (_, DamageOnMoon))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_5\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnSquare = RaidTargets [32]\n				if (DamageOnSquare) then\n				    GameCooltip:AddLine (RAID_TARGET_6 .. \":\", format_func (_, DamageOnSquare))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_6\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n\n				local DamageOnCross = RaidTargets [64]\n				if (DamageOnCross) then\n				    GameCooltip:AddLine (RAID_TARGET_7 .. \":\", format_func (_, DamageOnCross))\n				    GameCooltip:AddIcon (\"Interface\\\\TARGETINGFRAME\\\\UI-RaidTargetingIcon_7\", 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height)\n				    Details:AddTooltipBackgroundStatusbar()\n				end\n			",
			["attribute"] = false,
			["name"] = "Damage On Other Marked Targets",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for _, actor in ipairs (Combat:GetActorList (DETAILS_ATTRIBUTE_DAMAGE)) do\n				    if (actor:IsPlayer()) then\n					local total = (actor.raid_targets [1] or 0) --star\n					total = total + (actor.raid_targets [2] or 0) --circle\n					total = total + (actor.raid_targets [4] or 0) --diamond\n					total = total + (actor.raid_targets [8] or 0) --tiangle\n					total = total + (actor.raid_targets [16] or 0) --moon\n					total = total + (actor.raid_targets [32] or 0) --square\n					total = total + (actor.raid_targets [64] or 0) --cross\n					\n					if (total > 0) then\n					    CustomContainer:AddValue (actor, total)\n					end\n				    end\n				end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\TARGETINGFRAME\\UI-RaidTargetingIcon_5",
			["script_version"] = 3,
		}, -- [9]
		{
			["source"] = false,
			["author"] = "Details!",
			["desc"] = "Damage done to shields",
			["tooltip"] = "				--get the parameters passed\n				local actor, Combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip\n\n				--Cooltip code\n				--get the actor total damage absorbed\n				local totalAbsorb = actor.totalabsorbed\n				local format_func = Details:GetCurrentToKFunction()\n\n				--get the damage absorbed by all the actor pets\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n				    end\n				end\n\n				GameCooltip:AddLine (actor:Name(), format_func (_, actor.totalabsorbed))\n				Details:AddTooltipBackgroundStatusbar()\n\n				for petIndex, petName in ipairs (actor.pets) do\n				    local pet = Combat :GetActor (1, petName)\n				    if (pet) then\n					totalAbsorb = totalAbsorb + pet.totalabsorbed\n					\n					GameCooltip:AddLine (petName, format_func (_, pet.totalabsorbed))\n					Details:AddTooltipBackgroundStatusbar()        \n					\n				    end\n				end\n			",
			["attribute"] = false,
			["name"] = "Damage on Shields",
			["script"] = "				--get the parameters passed\n				local Combat, CustomContainer, Instance = ...\n				--declade the values to return\n				local total, top, amount = 0, 0, 0\n\n				--do the loop\n				for index, actor in ipairs (Combat:GetActorList(1)) do\n				    if (actor:IsPlayer()) then\n					\n					--get the actor total damage absorbed\n					local totalAbsorb = actor.totalabsorbed\n					\n					--get the damage absorbed by all the actor pets\n					for petIndex, petName in ipairs (actor.pets) do\n					    local pet = Combat :GetActor (1, petName)\n					    if (pet) then\n						totalAbsorb = totalAbsorb + pet.totalabsorbed\n					    end\n					end\n					\n					--add the value to the actor on the custom container\n					CustomContainer:AddValue (actor, totalAbsorb)        \n					\n				    end\n				end\n				--loop end\n\n				--if not managed inside the loop, get the values of total, top and amount\n				total, top = CustomContainer:GetTotalAndHighestValue()\n				amount = CustomContainer:GetNumActors()\n\n				--return the values\n				return total, top, amount\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\ICONS\\Spell_Holy_PowerWordShield",
			["script_version"] = 1,
		}, -- [10]
		{
			["source"] = false,
			["total_script"] = "				local value, top, total, combat, instance = ...\n				return value\n			",
			["author"] = "Details!",
			["percent_script"] = "				local value, top, total, combat, instance = ...\n\n				--get the time of overall combat\n				local OverallCombatTime = Details:GetCombat (-1):GetCombatTime()\n				\n				--get the time of current combat if the player is in combat\n				if (Details.in_combat) then\n					local CurrentCombatTime = Details:GetCombat (0):GetCombatTime()\n					OverallCombatTime = OverallCombatTime + CurrentCombatTime\n				end\n				\n				--calculate the DPS and return it as percent\n				local totalValue = value\n				\n				--build the string\n				local ToK = Details:GetCurrentToKFunction()\n				local s = ToK (_, value / OverallCombatTime)\n				\n				return s\n			",
			["desc"] = "Show overall damage done on the fly.",
			["attribute"] = false,
			["script"] = "				--init:\n				local combat, instance_container, instance = ...\n				local total, top, amount = 0, 0, 0\n				\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n				\n				if (not OverallCombat.GetActorList or not CurrentCombat.GetActorList) then\n					return 0, 0, 0\n				end\n				\n				--get the damage actor container for overall\n				local damage_container_overall = OverallCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				--get the damage actor container for current\n				local damage_container_current = CurrentCombat:GetActorList ( DETAILS_ATTRIBUTE_DAMAGE )\n				\n				--do the loop:\n				for _, player in ipairs ( damage_container_overall ) do \n					--only player in group\n					if (player:IsGroupPlayer()) then\n						instance_container:AddValue (player, player.total)\n					end\n				end\n				\n				if (Details.in_combat) then\n					for _, player in ipairs ( damage_container_current ) do \n						--only player in group\n						if (player:IsGroupPlayer()) then\n							instance_container:AddValue (player, player.total)        \n						end\n					end\n				end\n				\n				total, top =  instance_container:GetTotalAndHighestValue()\n				amount =  instance_container:GetNumActors()\n				\n				--return:\n				return total, top, amount\n			",
			["name"] = "Dynamic Overall Damage",
			["tooltip"] = "				--get the parameters passed\n				local actor, combat, instance = ...\n\n				--get the cooltip object (we dont use the convencional GameTooltip here)\n				local GameCooltip = GameCooltip2\n\n				--Cooltip code\n				--get the overall combat\n				local OverallCombat = Details:GetCombat (-1)\n				--get the current combat\n				local CurrentCombat = Details:GetCombat (0)\n\n				local AllSpells = {}\n\n				local playerTotal = 0\n\n				--overall\n				local player = OverallCombat [1]:GetActor (actor.nome)\n				playerTotal = playerTotal + player.total\n				local playerSpells = player:GetSpellList()\n				for spellID, spellTable in pairs (playerSpells) do\n					AllSpells [spellID] = spellTable.total\n				end\n\n				--current\n				local player = CurrentCombat [1]:GetActor (actor.nome)\n				if (player) then\n					playerTotal = playerTotal + player.total\n					local playerSpells = player:GetSpellList()\n					for spellID, spellTable in pairs (playerSpells) do\n						AllSpells [spellID] = (AllSpells [spellID] or 0) + (spellTable.total or 0)\n					end\n				end\n\n				local sortedList = {}\n				for spellID, total in pairs (AllSpells) do\n					tinsert (sortedList, {spellID, total})\n				end\n				table.sort (sortedList, Details.Sort2)\n\n				local format_func = Details:GetCurrentToKFunction()\n\n				--build the tooltip\n\n				local topSpellTotal = sortedList and sortedList[1] and sortedList[1][2] or 0\n\n				for i, t in ipairs (sortedList) do\n					local spellID, total = unpack (t)\n					if (total > 1) then\n						local spellName, _, spellIcon = Details.GetSpellInfo (spellID)\n						\n						local spellPercent = total / playerTotal * 100\n						local formatedSpellPercent = format(\"%.1f\", spellPercent)\n						\n						if (string.len(formatedSpellPercent) < 4) then\n							formatedSpellPercent = formatedSpellPercent  .. \"0\"\n						end\n						\n						GameCooltip:AddLine (spellName, format_func (_, total) .. \"    \" .. formatedSpellPercent  .. \"%\")\n						\n						Details:AddTooltipBackgroundStatusbar(false, total / topSpellTotal * 100)\n						GameCooltip:AddIcon (spellIcon, 1, 1, _detalhes.tooltip.line_height, _detalhes.tooltip.line_height, 0.078125, 0.921875, 0.078125, 0.921875)\n						\n					end\n				end\n			",
			["target"] = false,
			["spellid"] = false,
			["icon"] = "Interface\\Buttons\\Spell-Reset",
			["script_version"] = 6,
		}, -- [11]
	},
	["latest_news_saw"] = "v9.0.5.8357",
	["global_plugin_database"] = {
		["DETAILS_PLUGIN_ENCOUNTER_DETAILS"] = {
			["encounter_timers_bw"] = {
			},
			["encounter_timers_dbm"] = {
			},
		},
	},
	["mythic_plus"] = {
		["make_overall_boss_only"] = false,
		["mythicrun_chart_frame"] = {
			["y"] = -3.814697265625e-06,
			["x"] = 4.9591064453125e-05,
			["point"] = "CENTER",
			["scale"] = 1,
		},
		["merge_boss_trash"] = true,
		["delay_to_show_graphic"] = 5,
		["always_in_combat"] = false,
		["make_overall_when_done"] = true,
		["delete_trash_after_merge"] = true,
		["show_damage_graphic"] = true,
		["mythicrun_chart_frame_ready"] = {
			["y"] = 0,
			["x"] = -3.0517578125e-05,
			["point"] = "CENTER",
			["scale"] = 1,
		},
		["boss_dedicated_segment"] = true,
		["mythicrun_chart_frame_minimized"] = {
			["y"] = 1.52587890625e-05,
			["x"] = 0,
			["point"] = "CENTER",
			["scale"] = 1,
		},
		["last_mythicrun_chart"] = {
		},
	},
	["show_totalhitdamage_on_overkill"] = false,
	["current_exp_raid_encounters"] = {
	},
	["data_wipes_exp"] = {
		["9"] = true,
		["14"] = false,
		["13"] = false,
		["12"] = false,
		["11"] = false,
		["10"] = false,
	},
	["spellid_ignored"] = {
	},
	["createauraframe"] = {
		["y"] = -1.1444091796875e-05,
		["x"] = 4.57763671875e-05,
		["point"] = "CENTER",
		["scale"] = 1,
	},
	["item_level_pool"] = {
		["Player-1301-03507FEA"] = {
			["time"] = 1616351439,
			["name"] = "Azurr-Outland",
			["ilvl"] = 213.1875,
		},
		["Player-1329-098CE4CB"] = {
			["name"] = "Zoanel-Ravencrest",
			["time"] = 1616286520,
			["ilvl"] = 171.1875,
		},
		["Player-1301-0BC5F735"] = {
			["name"] = "Machiato-Outland",
			["time"] = 1616286514,
			["ilvl"] = 200.0625,
		},
		["Player-1313-0572E86C"] = {
			["name"] = "Subzz-Thunderhorn",
			["time"] = 1616286520,
			["ilvl"] = 199.125,
		},
		["Player-3702-098A0C47"] = {
			["time"] = 1616351537,
			["name"] = "Relaeya",
			["ilvl"] = 211.125,
		},
		["Player-3666-057D7B69"] = {
			["name"] = "Qmorth-Aszune",
			["time"] = 1616287203,
			["ilvl"] = 220.0625,
		},
		["Player-3702-097BD815"] = {
			["name"] = "Doshi",
			["time"] = 1616289441,
			["ilvl"] = 213.375,
		},
		["Player-3656-0A28B0E0"] = {
			["name"] = "Seko-Vashj",
			["time"] = 1616287203,
			["ilvl"] = 213.75,
		},
		["Player-3657-0A0980C2"] = {
			["name"] = "Qiuseppe-Darksorrow",
			["time"] = 1616286520,
			["ilvl"] = 211.375,
		},
		["Player-3666-08EBA737"] = {
			["name"] = "Sindera-Aszune",
			["time"] = 1616287203,
			["ilvl"] = 212.8125,
		},
		["Player-3391-0BE2AC08"] = {
			["time"] = 1616351439,
			["name"] = "Deepwater-Silvermoon",
			["ilvl"] = 199.5625,
		},
		["Player-1597-0CFF02C8"] = {
			["name"] = "Jokas-Sylvanas",
			["time"] = 1616286520,
			["ilvl"] = 145.6875,
		},
		["Player-1929-0EE5ADC6"] = {
			["time"] = 1616351490,
			["name"] = "Виллидру-Борейскаятундра",
			["ilvl"] = 199.8666666666667,
		},
		["Player-3657-0A8C2DE4"] = {
			["name"] = "Isojako-Darksorrow",
			["time"] = 1616286914,
			["ilvl"] = 220.0625,
		},
		["Player-3702-0A24AE57"] = {
			["name"] = "Manachai",
			["time"] = 1616287203,
			["ilvl"] = 221.8125,
		},
		["Player-3657-0A9C7CD6"] = {
			["name"] = "Xnotably-Darksorrow",
			["time"] = 1616286520,
			["ilvl"] = 190,
		},
		["Player-3391-0BDD7CE4"] = {
			["name"] = "Ollaflock-Silvermoon",
			["time"] = 1616286520,
			["ilvl"] = 210.375,
		},
		["Player-3666-08903F33"] = {
			["name"] = "Vate-Aszune",
			["time"] = 1616287203,
			["ilvl"] = 221.6875,
		},
		["Player-1301-0A7B3EB9"] = {
			["name"] = "Kiluvõileib-Outland",
			["time"] = 1616286520,
			["ilvl"] = 141,
		},
	},
	["realm_sync"] = true,
	["savedCustomSpells"] = {
		{
			339538, -- [1]
			"Templar's Verdict (Templar's Vindication)", -- [2]
			461860, -- [3]
		}, -- [1]
		{
			2, -- [1]
			"Auto Shot", -- [2]
			"Interface\\ICONS\\INV_Weapon_Bow_07", -- [3]
		}, -- [2]
		{
			3, -- [1]
			"Environment (Falling)", -- [2]
			"Interface\\ICONS\\Spell_Magic_FeatherFall", -- [3]
		}, -- [3]
		{
			55090, -- [1]
			"Scourge Strike (Physical)", -- [2]
			237530, -- [3]
		}, -- [4]
		{
			4, -- [1]
			"Environment (Drowning)", -- [2]
			"Interface\\ICONS\\Ability_Suffocate", -- [3]
		}, -- [5]
		{
			5, -- [1]
			"Environment (Fatigue)", -- [2]
			"Interface\\ICONS\\Spell_Arcane_MindMastery", -- [3]
		}, -- [6]
		{
			6, -- [1]
			"Environment (Fire)", -- [2]
			"Interface\\ICONS\\INV_SummerFest_FireSpirit", -- [3]
		}, -- [7]
		{
			7, -- [1]
			"Environment (Lava)", -- [2]
			"Interface\\ICONS\\Ability_Rhyolith_Volcano", -- [3]
		}, -- [8]
		{
			8, -- [1]
			"Environment (Slime)", -- [2]
			"Interface\\ICONS\\Ability_Creature_Poison_02", -- [3]
		}, -- [9]
		{
			59638, -- [1]
			"Frostbolt (Mirror Image)", -- [2]
			135846, -- [3]
		}, -- [10]
		{
			49184, -- [1]
			"Howling Blast (Main Target)", -- [2]
			135833, -- [3]
		}, -- [11]
		{
			44461, -- [1]
			"Living Bomb (explosion)", -- [2]
			236220, -- [3]
		}, -- [12]
		{
			278227, -- [1]
			"Barkspines (Trinket)", -- [2]
			134439, -- [3]
		}, -- [13]
		{
			268998, -- [1]
			"Kindled Soul (Trinket)", -- [2]
			651093, -- [3]
		}, -- [14]
		{
			196917, -- [1]
			"Light of the Martyr (Damage)", -- [2]
			135938, -- [3]
		}, -- [15]
		{
			120761, -- [1]
			"Glaive Toss (Glaive #2)", -- [2]
			132330, -- [3]
		}, -- [16]
		{
			278812, -- [1]
			"Lion's Grace (Trinket)", -- [2]
			464140, -- [3]
		}, -- [17]
		{
			270827, -- [1]
			"Webweaver's Soul Gem (Trinket)", -- [2]
			237431, -- [3]
		}, -- [18]
		{
			212739, -- [1]
			"Epidemic (Main Target)", -- [2]
			136066, -- [3]
		}, -- [19]
		{
			279664, -- [1]
			"Bloody Bile (Trinket)", -- [2]
			136007, -- [3]
		}, -- [20]
		{
			237680, -- [1]
			"Howling Blast (AoE)", -- [2]
			135833, -- [3]
		}, -- [21]
		{
			215969, -- [1]
			"Epidemic (AoE)", -- [2]
			136066, -- [3]
		}, -- [22]
		{
			278359, -- [1]
			"Blood Hatred (Trinket)", -- [2]
			132175, -- [3]
		}, -- [23]
		{
			278057, -- [1]
			"Volatile Blood Explosion (Trinket)", -- [2]
			538040, -- [3]
		}, -- [24]
		{
			278155, -- [1]
			"Lingering Power of Xalzaix (Trinket)", -- [2]
			254105, -- [3]
		}, -- [25]
		{
			271115, -- [1]
			"Ignition Mage's Fuse (Trinket)", -- [2]
			1119937, -- [3]
		}, -- [26]
		{
			277179, -- [1]
			"Gladiator's Medallion (Trinket)", -- [2]
			252267, -- [3]
		}, -- [27]
		{
			70890, -- [1]
			"Scourge Strike (Shadow)", -- [2]
			237530, -- [3]
		}, -- [28]
		{
			277185, -- [1]
			"Gladiator's Badge (Trinket)", -- [2]
			135884, -- [3]
		}, -- [29]
		{
			278383, -- [1]
			"Ruffling Tempest (Trinket)", -- [2]
			2103829, -- [3]
		}, -- [30]
		{
			228649, -- [1]
			"Blackout Kick (Passive)", -- [2]
			574575, -- [3]
		}, -- [31]
		{
			277187, -- [1]
			"Gladiator's Emblem (Trinket)", -- [2]
			132344, -- [3]
		}, -- [32]
		{
			94472, -- [1]
			"Atonement (critical)", -- [2]
			135887, -- [3]
		}, -- [33]
		{
			121414, -- [1]
			"Glaive Toss (Glaive #1)", -- [2]
			132330, -- [3]
		}, -- [34]
		{
			277181, -- [1]
			"Gladiator's Insignia (Trinket)", -- [2]
			134501, -- [3]
		}, -- [35]
		{
			271462, -- [1]
			"Rotcrusted Voodoo Doll (Trinket)", -- [2]
			1716867, -- [3]
		}, -- [36]
		{
			270925, -- [1]
			"Waterspout (Trinket)", -- [2]
			1698701, -- [3]
		}, -- [37]
		{
			278862, -- [1]
			"Chill of the Runes (Trinket)", -- [2]
			252270, -- [3]
		}, -- [38]
		{
			271071, -- [1]
			"Conch of Dark Whispers (Trinket)", -- [2]
			1498840, -- [3]
		}, -- [39]
		{
			271465, -- [1]
			"Rotcrusted Voodoo Doll (Trinket)", -- [2]
			1716867, -- [3]
		}, -- [40]
		{
			33778, -- [1]
			"Lifebloom (Bloom)", -- [2]
			134206, -- [3]
		}, -- [41]
		{
			88082, -- [1]
			"Fireball (Mirror Image)", -- [2]
			135812, -- [3]
		}, -- [42]
		{
			1, -- [1]
			"Melee", -- [2]
			"Interface\\ICONS\\INV_Sword_04", -- [3]
		}, -- [43]
		{
			345020, -- [1]
			"Skulking Predator (Trinket)", -- [2]
			2103921, -- [3]
		}, -- [44]
		{
			271671, -- [1]
			"Cacaphonous Chord (Trinket)", -- [2]
			454048, -- [3]
		}, -- [45]
		{
			98021, -- [1]
			"Health Exchange", -- [2]
			237586, -- [3]
		}, -- [46]
		{
			108271, -- [1]
			"Astral Shift", -- [2]
			"Interface\\Addons\\Details\\images\\icon_astral_shift", -- [3]
		}, -- [47]
	},
	["profile_by_spec"] = {
	},
	["update_warning_timeout"] = 10,
	["raid_data"] = {
	},
	["switchSaved"] = {
		["slots"] = 10,
		["table"] = {
			{
				["atributo"] = 1,
				["sub_atributo"] = 1,
			}, -- [1]
			{
				["atributo"] = 2,
				["sub_atributo"] = 1,
			}, -- [2]
			{
				["atributo"] = 1,
				["sub_atributo"] = 6,
			}, -- [3]
			{
				["atributo"] = 4,
				["sub_atributo"] = 5,
			}, -- [4]
			{
				["atributo"] = 1,
				["sub_atributo"] = 3,
			}, -- [5]
			{
			}, -- [6]
			{
			}, -- [7]
			{
			}, -- [8]
			{
			}, -- [9]
			{
			}, -- [10]
			{
			}, -- [11]
			{
			}, -- [12]
			{
			}, -- [13]
			{
			}, -- [14]
			{
			}, -- [15]
			{
			}, -- [16]
			{
			}, -- [17]
			{
			}, -- [18]
			{
			}, -- [19]
			{
			}, -- [20]
			{
			}, -- [21]
			{
			}, -- [22]
			{
			}, -- [23]
			{
			}, -- [24]
		},
	},
	["always_use_profile_name"] = "",
	["savedStyles"] = {
	},
	["always_use_profile_exception"] = {
	},
	["details_auras"] = {
	},
	["displays_by_spec"] = {
	},
	["savedTimeCaptures"] = {
	},
	["plugin_window_pos"] = {
		["y"] = -35.4666748046875,
		["x"] = 17.59995269775391,
		["point"] = "TOP",
		["scale"] = 1,
	},
	["damage_scroll_position"] = {
	},
	["performance_profiles"] = {
		["Dungeon"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["RaidFinder"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Battleground40"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Mythic"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Arena"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid30"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
		["Raid15"] = {
			["enabled"] = false,
			["update_speed"] = 1,
			["miscdata"] = true,
			["aura"] = true,
			["heal"] = true,
			["use_row_animations"] = false,
			["energy"] = false,
			["damage"] = true,
		},
	},
	["last_changelog_size"] = 6382,
	["immersion_unit_special_icons"] = true,
	["lastUpdateWarning"] = 1615928294,
	["report_where"] = "PARTY",
}
